Функция ПоУмолчанию() Экспорт
	ТочкиОтгрузки = Справочники.mona_ТочкиОтгрузки.Выбрать();
	Отказ = Ложь;
	Пока ТочкиОтгрузки.Следующий() Цикл 
		Если Не ТочкиОтгрузки.ПометкаУдаления Тогда 
			ТочкаОтгрузки = ТочкиОтгрузки.Ссылка; 
			ПроверкаЗаполнения(ТочкаОтгрузки,Отказ); 
			Если Отказ Тогда 
            	Сообщить("Не полностью заполнен поля для Точки отгрузки");
			КонецЕсли;	
			Возврат ТочкаОтгрузки;
		КонецЕсли;
    КонецЦикла;

КонецФункции        
Процедура ПроверкаЗаполнения(ТочкаОтгрузки,Отказ)
	
	Если ПоляНеЗаполнены(ТочкаОтгрузки) Тогда 
		СпрОбъект = ТочкаОтгрузки.ПолучитьОбъект();
	Иначе
		Возврат;
	КонецЕсли;	
	Если СпрОбъект.ОсновнаяТочка.Пустая() Тогда 
		СпрОбъект.ОсновнаяТочка = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Naturalia",Истина);
	КонецЕсли;	
	Если ПустаяСтрока(СпрОбъект.Адрес) Тогда
		СпрОбъект.Адрес = "010000, Город Астана, район Байқоңыр, Сембинова улица, д. 7, нп. 16";
	КонецЕсли;	
	Если ПустаяСтрока(СпрОбъект.КоординатыДолгота) Тогда
		СпрОбъект.КоординатыДолгота = 51.16838;
	КонецЕсли;	
	Если ПустаяСтрока(СпрОбъект.КоординатыШирота) Тогда
		СпрОбъект.КоординатыШирота = 71.44822;
	КонецЕсли;	
	Если СпрОбъект.Склад.Пустая() Тогда
		СпрОбъект.ОсновнаяТочка = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Сембинова 7 нп 16",Истина);	
	КонецЕсли;	
	Если СпрОбъект.РозничныйМагазин.Пустая() Тогда
		СпрОбъект.ОсновнаяТочка = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Розничный Магазин Naturalia",Истина);	
	КонецЕсли;	
	Если СпрОбъект.ВидЦеныОнлайн.Пустая() Тогда
		СпрОбъект.ВидЦеныОнлайн = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная цена",Истина);	
	КонецЕсли;	
	Если СпрОбъект.ВидЦеныМагазин.Пустая() Тогда
		СпрОбъект.ВидЦеныМагазин = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная цена",Истина);	
	КонецЕсли;	
	Если СпрОбъект.СлужбаДоставки.Пустая() Тогда
		СпрОбъект.СлужбаДоставки = Справочники.СлужбыДоставки.НайтиПоНаименованию("Яндекс",Истина);	
	КонецЕсли;	
	Если ПоляНеЗаполнены(СпрОбъект) Тогда 
		Отказ = Истина
	КонецЕсли;
	СпрОбъект.Записать();
КонецПроцедуры 

Функция ПоляНеЗаполнены(Спр)
	Возврат Спр.ОсновнаяТочка.Пустая() 
		ИЛИ ПустаяСтрока(Спр.Адрес)
		ИЛИ ПустаяСтрока(Спр.КоординатыДолгота)
		ИЛИ ПустаяСтрока(Спр.КоординатыШирота)
		ИЛИ Спр.Склад.Пустая()
		ИЛИ Спр.РозничныйМагазин.Пустая()
		ИЛИ Спр.ВидЦеныОнлайн.Пустая()
		ИЛИ Спр.ВидЦеныМагазин.Пустая() 
		ИЛИ Спр.СлужбаДоставки.Пустая(); 
	
КонецФункции
