&НаСервере
Функция ДобавитьПодгруппу(Элементы,ИмяГруппы, Заголовок, Родитель) Экспорт 
	Гр = Элементы.Добавить(ИмяГруппы,Тип("ГруппаФормы"),Родитель);
	Гр.Вид = ВидГруппыФормы.ОбычнаяГруппа;  
	Гр.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
	Гр.Заголовок = Заголовок;      
	Гр.ОтображатьЗаголовок = Истина;
	Гр.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;    
	Гр.Ширина = 30; 
	Возврат Гр;
КонецФункции

&НаСервере
Процедура ДобавитьПолеФормы(Элементы,ИмяРеквизита, Группа, Заголовок = "",ПутьКДанным = "") Экспорт
	Поле = Элементы.Добавить("mona_Поле_" + ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Если ПутьКДанным = "" Тогда 
		Поле.ПутьКДанным = ИмяРеквизита;     
	Иначе
		Поле.ПутьКДанным = ПутьКДанным;     
	КонецЕсли;	
	Поле.РастягиватьПоГоризонтали = Ложь;    
	Поле.Ширина = 10;
	Если ЗначениеЗаполнено(Заголовок) Тогда
		Поле.Заголовок = Заголовок;
	Иначе
		Поле.Заголовок =  РазбитьПоЗаглавным(ИмяРеквизита);
	КонецЕсли;	
	
	Если ИмяРеквизита = "ПричинаОтмены" Тогда
		Поле.УстановитьДействие("ПриИзменении", "mona_ПричинаОтменыПриИзменении");
	ИначеЕсли ИмяРеквизита = "ПризнакЧастичнойСборки" Тогда  
		Поле.УстановитьДействие("ПриИзменении", "ПризнакЧастичнойСборкиПриИзменении");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РазбитьПоЗаглавным(Стр)
	Результат = "";
	Для Сч = 1 По СтрДлина(Стр) Цикл
		Симв = Сред(Стр, Сч, 1);
		Если Сч > 1 И Симв = ВРег(Симв) И Симв <> НРег(Симв) Тогда
			Результат = Результат + " " + НРег(Симв);
		Иначе
			Результат = Результат + Симв;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

	
