&НаСервере
Процедура mona_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
		Добавляемые = новый массив;
	Добавляемые.Добавить(Новый РеквизитФормы("Штрихкод", Новый ОписаниеТипов("Строка")));
	ИзменитьРеквизиты(Добавляемые);  
	Если Объект.Ссылка.Пустая() тогда
	Группа = Элементы.Найти("ОсновныеРеквизиты");	
	Mona_ДобавитьПолеФормы("Штрихкод",Группа);
	конецесли;
КонецПроцедуры


&НаСервере
&После("ЗаполнитьАктуальныеЦены")
Процедура mona_ЗаполнитьАктуальныеЦены(Данные)
	Если РольДоступна("mona_ОператорЗаказов") тогда 
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") 
			И СтрНайти(Элемент.Имя, "АктуальнаяЦенаВидЦен") > 0 Тогда
			
			ТекстЦены = Элемент.Заголовок;
			Если СтрНайти(ТекстЦены, "Учетная") > 0 Тогда
				// Получаем родительскую группу и скрываем её
				Группа = Элемент.Родитель;
				Если Группа <> Неопределено Тогда
					Группа.Видимость = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция Mona_ПолучитьСледующийПосле(ИмяЭлемента)                                                  
	Элем = Элементы.Найти(ИмяЭлемента);
	Если Элем = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Родитель = Элем.Родитель;
	Индекс = Родитель.ПодчиненныеЭлементы.Индекс(Элем);
	Если Индекс +1< Родитель.ПодчиненныеЭлементы.Количество() Тогда
		Возврат Родитель.ПодчиненныеЭлементы.Получить(Индекс +1);
	КонецЕсли;
	Возврат Неопределено;		
КонецФункции

&НаКлиенте
Процедура mona_ПриОткрытииПосле(Отказ)
	Элементы.ГруппаСредствоИндивидуальнойЗащиты.Видимость = Ложь;
	Элементы.ГруппаПродукцияИСМПТК.Видимость = Ложь;
	Элементы.ГруппаПродукцияИС.Видимость = Ложь;
	Элементы.ГруппаМаркировка.Видимость = Ложь;
	Элементы.ГруппаАлкогольнаяПродукцияРК.Видимость = Ложь;
	Элементы.ГруппаАлкогольнаяПродукция.Видимость = Ложь;
	Элементы.ГруппаВЕТИС.Видимость = Ложь;   
	Элементы.ГруппаХранение.Видимость = Ложь;
	Элементы.ГруппаУчетнаяИнформация.Видимость = Ложь;
	Элементы.ГруппаЗакупкаПроизводство.Видимость = Ложь;
	Элементы.ГруппаСертификаты.Видимость = Ложь;
	Элементы.ГруппаПрайсЛист.Видимость = Ложь;
	Элементы.ТоварыСВозрастнымОграничением.Видимость = Ложь; 
	Элементы.ДинамикаПродаж.Видимость = Ложь;
	Элементы.ДинамикаЦен.Видимость = Ложь;
	УстановитьТипХраненияНаСервере();
КонецПроцедуры    


&НаСервере
Процедура Mona_ДобавитьПолеФормы(ИмяРеквизита, Группа, Заголовок = "") 
	Поле = Элементы.Добавить("mona_Поле_" + ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = ИмяРеквизита;     
	Поле.РастягиватьПоГоризонтали = Ложь;    
	Поле.Ширина = 15;
	Если ЗначениеЗаполнено(Заголовок) Тогда
		Поле.Заголовок = Заголовок;
	Иначе
		Поле.Заголовок =  Mona_РазбитьПоЗаглавным(ИмяРеквизита);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция Mona_РазбитьПоЗаглавным(Стр)
	Результат = "";
	Для Сч = 1 По СтрДлина(Стр) Цикл
		Симв = Сред(Стр, Сч, 1);
		Если Сч > 1 И Симв = ВРег(Симв) И Симв <> НРег(Симв) Тогда
			Результат = Результат + " " + НРег(Симв);
		Иначе
			Результат = Результат + Симв;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции


&НаСервере
Функция НайтиДубльШтрихкода(Штрихкод, ТекущийЭлемент) Экспорт
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат Неопределено;   
	   КонецЕсли;	
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ШтрихкодыНоменклатуры.Номенклатура КАК Ссылка,
	                  |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                  |ИЗ
	                  |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                  |ГДЕ
	                  |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	//Запрос.УстановитьПараметр("ТекущийЭлемент", ТекущийЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	         
КонецФункции

&НаКлиенте
Процедура mona_ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая() тогда
	 мШтрих =ЭтаФорма["Штрихкод"] ;
	Если ПустаяСтрока(мШтрих) Тогда
		Сообщить("Внесите штрихкод товара!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НайденнаяНоменклатура = НайтиДубльШтрихкода(мШтрих, Объект.Ссылка);
	
	Если НайденнаяНоменклатура <> Неопределено Тогда
		
		Отказ = Истина; 
		Оповещение = новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект,НайденнаяНоменклатура);
		ПоказатьВопрос( Оповещение,
		"Номенклатура со штрихкодом '" + мШтрих + "' уже существует. Открыть карточку?",
		РежимДиалогаВопрос.ДаНет);	
	Иначе
			
	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ,ДопПараметры) Экспорт
	ПараметрыФормы = Новый Структура("Ключ",ДопПараметры);
	Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма=ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",ПараметрыФормы);
			Форма.Открыть();
	Иначе
			Сообщить("Создание номенклатуры с дублирующим штрихкодом запрещено!");
	КонецЕсли;
конецпроцедуры
	
&НаСервере
Процедура mona_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьТипХраненияНаСервере()
	
	ТекущаяГруппа = Объект.Родитель;
	
	Пока ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Цикл
		Если Объект.КатегорияНоменклатуры.Наименование = "Охлажденное" ИЛИ Объект.КатегорияНоменклатуры.Родитель.Наименование = "Охлажденное" Тогда    			
			ТипХранения = "Охлажденный";
			Прервать;  		
		ИначеЕсли Объект.КатегорияНоменклатуры.Наименование = "Замороженное" ИЛИ Объект.КатегорияНоменклатуры.Родитель.Наименование = "Замороженное" Тогда
			ТипХранения = "Замороженный";
			Прервать;
		Иначе
			ТипХранения = "Обычный";   
			Прервать  ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры   

&НаКлиенте
Процедура mona_КатегорияНоменклатурыПриИзмененииПосле(Элемент)
	УстановитьТипХраненияНаСервере();
КонецПроцедуры        

&НаКлиенте
Процедура mona_УстановитьСкоропортящийся()

КонецПроцедуры 


&НаСервере
Процедура mona_mona_ПризнакПродажиОнлайнПриИзмененииПослеНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура mona_mona_ПризнакПродажиОнлайнПриИзмененииПосле(Элемент)
	ЦенаНайдена = ложь;
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") 
			И СтрНайти(Элемент.Имя, "АктуальнаяЦенаВидЦен") > 0 Тогда
			
			ТекстЦены = Элемент.Заголовок;
			Если СтрНайти(ТекстЦены, "Интернет-цена") > 0 Тогда
				ЦенаНайдена = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если не ЦенаНайдена тогда
	mona_ПризнакПродажиОнлайн = Ложь;
	Сообщить("Отстутсвует цена для интернет продажи");
    Конецесли;
	mona_mona_ПризнакПродажиОнлайнПриИзмененииПослеНаСервере();
	
КонецПроцедуры

&НаКлиенте
&После("УправлениеФормой")
Процедура mona_УправлениеФормой(ОткрытиеФормы)
	Элементы.ГруппаСредствоИндивидуальнойЗащиты.Видимость = Ложь;
	Элементы.ГруппаПродукцияИСМПТК.Видимость = Ложь;
	Элементы.ГруппаПродукцияИС.Видимость = Ложь;
	Элементы.ГруппаМаркировка.Видимость = Ложь;
	Элементы.ГруппаАлкогольнаяПродукцияРК.Видимость = Ложь;
	Элементы.ГруппаАлкогольнаяПродукция.Видимость = Ложь;
	Элементы.ГруппаВЕТИС.Видимость = Ложь;   
	Элементы.ГруппаХранение.Видимость = Ложь;
	Элементы.ГруппаУчетнаяИнформация.Видимость = Ложь;
	Элементы.ГруппаЗакупкаПроизводство.Видимость = Ложь;
	Элементы.ГруппаСертификаты.Видимость = Ложь;
	Элементы.ГруппаПрайсЛист.Видимость = Ложь;
	Элементы.ТоварыСВозрастнымОграничением.Видимость = Ложь; 
	Элементы.ДинамикаПродаж.Видимость = Ложь;
	Элементы.ДинамикаЦен.Видимость = Ложь;

КонецПроцедуры


&НаСервере
Процедура mona_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	мШтрих = ЭтаФорма["Штрихкод"] ;
	Если НайтиДубльШтрихкода(мШтрих,Объект.Ссылка) = Неопределено и не ПустаяСтрока(мШтрих) тогда
	МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Штрихкод = мШтрих;
	МенеджерЗаписи.Номенклатура = Объект.Ссылка;
	МенеджерЗаписи.ЕдиницаИзмерения = Объект.Ссылка.ЕдиницаИзмерения;
	МенеджерЗаписи.Записать();
	Добавляемые = новый массив;
	Добавляемые.Добавить("Штрихкод");
	ИзменитьРеквизиты(,Добавляемые);
	конецЕсли;
    
КонецПроцедуры
