
&НаСервере
Процедура ПриСозданииНаСервере_Справочник_Номенклатура_ФормаЭлемента(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

КонецПроцедуры

&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура mona_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	ИмяПроцедуры = "ПриСозданииНаСервере_" + СтрЗаменить(СтрЗаменить(Форма.ИмяФормы,".Форма.","_"),".","_");

	Попытка
		Выполнить ИмяПроцедуры  + "(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)";
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Если Найти(ТекстОшибки, ИмяПроцедуры) = 0 Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ошибка при вызове обработчика %1:
			|%2", ИмяПроцедуры, ТекстОшибки);
		КонецЕсли;
	КонецПопытки;

КонецПроцедуры
