
&НаКлиенте
Асинх Процедура Тарифы(Команда)
	СтруктураЗапроса = Новый Структура("start_point,fullname",mona_ЯндексДоставка.Point(Долгота,Широта),Адрес);
	
	ДанныеТариф	= Ждать mona_ЯндексДоставка.tariffs(mona_ЯндексДоставка.Point(Долгота,Широта),Адрес);
	ДанныеДоступность = Ждать mona_ЯндексДоставка.delivery_methods(mona_ЯндексДоставка.Point(Долгота,Широта),Адрес);
	Интервалы.Очистить();
	
	Для Каждого стр из ДанныеДоступность.same_day_delivery.available_intervals Цикл
		НовСтр = Интервалы.Добавить();
		// время 
		ДатаС =  ПрочитатьДатуJSON(стр.from, ФорматДатыJSON.ISO);
		ДатаПо = ПрочитатьДатуJSON(стр.to,   ФорматДатыJSON.ISO); 
		
		НовСтр.С = ДатаС;
		НовСтр.По = ДатаПо;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТочкаОтгрузки = Справочники.mona_ТочкиОтгрузки.ПоУмолчанию();
	Долгота = ТочкаОтгрузки.КоординатыДолгота;
	Широта = ТочкаОтгрузки.КоординатыШирота;
	Адрес = ТочкаОтгрузки.Адрес; 
	ЧасовойПояс = ЧасовойПоясСеанса();
КонецПроцедуры

&НаКлиенте
асинх Процедура Оценка(Команда)
	ДанныеДокумента = СформироватьСтруктуруДокумента();
	Данные	= Ждать mona_ЯндексДоставка.check_price(ДанныеДокумента);
КонецПроцедуры 

//&НаСервере
//Function bodycheck()
//	_items = new array();
//	Для Каждого стр из Заказ.Запасы Цикл
//    	_items.add(Item(стр.Количество,,стр.Вес));	
//	КонецЦикла;
//	point1 = RoutePoint(Point(Долгота,Широта),Адрес);
//	point2 = RoutePoint(Point(Заказ.mona_Долгота,Заказ.mona_Широта),Заказ.АдресДоставки);
////	delivery_interval = Delivery_interval(Заказ.ВремяДоставкиС,Заказ.ВремяДоставкиПо);
//	delivery_interval = Delivery_interval(Интервалы[1].С,Интервалы[1].По);

//	requirements = Requirements("courier",,,,delivery_interval);
//	body =  new structure("items,route_points,requirements"
//							,_items
//	                        ,RoutePoints(point1,point2)
//                            ,requirements );
//    return body
//EndFunction

&НаКлиенте
асинх Процедура Заявка(Команда)

	ДанныеДокумента = СформироватьСтруктуруДокумента();
 	Данные	= Ждать mona_ЯндексДоставка.claims_create(ДанныеДокумента);
КонецПроцедуры
&НаСервере
Функция СформироватьСтруктуруДокумента() 
	Возврат mona_ДедлайныЗаказов.ДанныеЗаказа(Заказ) ;
КонецФункции

&НаКлиенте
Процедура СамоТестКаталог(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


