
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Перем ОсновнойСкладСсылка;
	//Если НЕ Объект.Ссылка.ЭтоНовый() Тогда
	//    Возврат;
	//КонецЕсли;
	//Объект = Объект.ПолучитьОбъект();

	//// Получаем ссылку на текущий (только что созданный) основной склад.
	//ОсновнойСкладСсылка = Объект.ОсновнаяТочка;

	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "В доставке",Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "Брак",Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "Просрочка",Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "Карантин",Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "Возврат поставщику",Перечисления.ТипыСтруктурныхЕдиниц.Склад); 
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "Розничный магазин",Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	//СоздатьПодчиненныйСклад(ОсновнойСкладСсылка, "ПВЗ",Перечисления.ТипыСтруктурныхЕдиниц.Склад);


КонецПроцедуры

Процедура СоздатьПодчиненныйСклад(Родитель, ИмяПодчиненногоСклада,ВидСклада)
    Перем НовыйСклад, ОписаниеОшибки;

    
    НовыйСклад = Справочники.СтруктурныеЕдиницы.СоздатьЭлемент();
    НовыйСклад.Родитель = Родитель;     
	НовыйСклад.Наименование = ИмяПодчиненногоСклада +" "+ Родитель.Наименование;
    НовыйСклад.ТипСтруктурнойЕдиницы = ВидСклада;
    Попытка
        НовыйСклад.Записать();
    Исключение
        ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        Сообщить("Не удалось создать склад '" + ИмяПодчиненногоСклада + "': " + ОписаниеОшибки);   
    КонецПопытки;

КонецПроцедуры