
&НаСервере
Процедура mona_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Родитель = Элементы.Найти("КолонкаСлева");
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Поле = Элементы.Добавить("mona_КаналКоммуникации", Тип("ПолеФормы"),Родитель);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "Объект.mona_КаналКоммуникации";    
	Поле.Заголовок = "Основной канал коммуникации";  
	
	Поле.РежимВыбораИзСписка = Истина;  
	Поле.СписокВыбора.Добавить("Телефон"); 
	Поле.СписокВыбора.Добавить("WhatsApp");
	Поле.СписокВыбора.Добавить("Telegram");
	Поле.СписокВыбора.Добавить("Email");  
КонецПроцедуры                                              

