
&Вместо("ДобавитьКомандыПечати")
Процедура mona_ДобавитьКомандыПечати(КомандыПечати)
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	// Общие
	//
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаказПокупателя";
	КомандаПечати.Представление = НСтр("ru = 'Заказ покупателя'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,РеквизитыПечатиЗаказПокупателя,ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	ВозможныеВарианты = Обработки.ПечатьСчетНаОплату.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = Обработки.ПечатьСчетНаОплату.ИдентификаторПечатнойФормы(СтрокаТаблицы.ЧастичнаяОплата, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(СтрокаТаблицы.ЧастичнаяОплата, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,РеквизитыПечатиЗаказПокупателя,ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
		КомандаПечати.Порядок = 7;
		
		Если СтрокаТаблицы.ЧастичнаяОплата Тогда
			
			КомандаПечати.ФункциональныеОпции = "ПлатежныйКалендарь";
			
		КонецЕсли;
		
		Если СтрокаТаблицы.ИспользоватьФаксимиле Тогда
			
			КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
			КомандаПечати.Порядок = 10;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Конверт";
	КомандаПечати.Представление = НСтр("ru = 'Конверт'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонверта";
	КомандаПечати.Порядок = 48;
	
	Если ПравоДоступа("Просмотр", Метаданные.Обработки.ПечатьЭтикетокИЦенников)
		И ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЦеныНоменклатуры)
		И ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников") Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЭтикетокИзЗаказаПокупателя";
		КомандаПечати.Представление = НСтр("ru = 'Печать этикеток'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 49;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЦенниковИзЗаказаПокупателя";
		КомандаПечати.Представление = НСтр("ru = 'Печать ценников'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 50;
		
	КонецЕсли;
	
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	// Заказ покупателя
	//
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Калькуляция";
	КомандаПечати.Представление = НСтр("ru = 'Калькуляция'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 23;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КалькуляцияСРазузлованием";
	КомандаПечати.Представление = НСтр("ru = 'Калькуляция с разузлованием'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 24;     
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "mona_РешениеПоВозврату";
	КомандаПечати.Представление = НСтр("ru = 'Решение по возврату'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 25;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СводныйОтчет";
	КомандаПечати.Представление = НСтр("ru = 'Сводно о заказе'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 26;      
	
	
	
	Если ОбщегоНазначенияУНФ.ЭтоУНФ() Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "КоммерческоеПредложение";
		КомандаПечати.Представление = НСтр("ru = 'Коммерческое предложение'");
		КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.МестоРазмещения = "КомандыПечатиКоммерческоеПредложение";
		КомандаПечати.Порядок = 99;
	КонецЕсли;
	
	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить(Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента);
	НазначенияШаблонов.Добавить(Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказ);
	ШаблоныПечатиОфисныхДокументов.ДобавитьКомандыПечати(НазначенияШаблонов, КомандыПечати, "ФормаДокумента,ФормаСписка", "КомандыПечатиДоговорКонтрагента", 99);
	
	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить(Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.КоммерческоеПредложение);
	ШаблоныПечатиОфисныхДокументов.ДобавитьКомандыПечати(НазначенияШаблонов, КомандыПечати, "ФормаДокумента,ФормаСписка", "КомандыПечатиКоммерческоеПредложение", 99);
	
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	// Заказ-наряд
	//
	
	КомандаПечати = КомандыПечати.Добавить();
	// УНФ для Казахстана
	//ЗначениеИдентификатора = "ЗаказПокупателя,ЗаказНаряд,АктОбОказанииУслуг,АктОбОказанииУслугПодробно,Накладная,НакладнаяСУслугами,СчетНаОплату,СчетНаЧастичнуюОплату,ТОРГ12,ТОРГ12СУслугами,ГарантийныйТалон,Обработка.ПечатьСчетФактура.УниверсальныйПередаточныйДокумент";
	ЗначениеИдентификатора = "ЗаказПокупателя,ЗаказНаряд,АктОбОказанииУслуг,АктОбОказанииУслугПодробно,Накладная,НакладнаяСУслугами,СчетНаОплату,СчетНаЧастичнуюОплату,АктОбОказанииУслугР1,АктОбОказанииУслугР1_СНДС,З2";
	// УНФ для Казахстана ---
	КомандаПечати.Идентификатор = СкорректироватьИдентификаторКомандыКомплекта(ЗначениеИдентификатора);
	КомандаПечати.Представление = ПечатьДокументовУНФ.ПредставлениеКомплектаДокументов();
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаказНаряд";
	КомандаПечати.Представление = НСтр("ru = 'Заказ-наряд'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 14;
	
	ВозможныеВарианты = Обработки.ПечатьАктаОбОказанииУслуг.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = Обработки.ПечатьАктаОбОказанииУслуг.ИдентификаторПечатнойФормы(СтрокаТаблицы.Подробно, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.Представление = Обработки.ПечатьАктаОбОказанииУслуг.ПредставлениеПФ(СтрокаТаблицы.Подробно, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 17;
		
		Если СтрокаТаблицы.ИспользоватьФаксимиле Тогда
			
			КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
			КомандаПечати.Порядок = 20;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВозможныеВарианты = Обработки.ПечатьНакладная.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = Обработки.ПечатьНакладная.ИдентификаторПечатнойФормы(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.Представление = Обработки.ПечатьНакладная.ПредставлениеПФ(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле);
		КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 23;
		
		Если СтрокаТаблицы.ИспользоватьФаксимиле Тогда
			
			КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
			КомандаПечати.Порядок = 26;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// УНФ для Казахстана
	// Акт об оказании услуг (Р-1)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслугР1Факсимиле";
	КомандаПечати.Представление = НСтр("ru = 'Р-1 (Акт выполненных работ)(факсимиле)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
	КомандаПечати.Порядок = 66;
	
	// Акт об оказании услуг (Р-1) (С НДС)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслугР1_СНДСФаксимиле";
	КомандаПечати.Представление = НСтр("ru = 'Р-1 (Акт выполненных работ, с НДС)(факсимиле)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
	КомандаПечати.Порядок = 67;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "З2Факсимиле";
	КомандаПечати.Представление = НСтр("ru = 'Накладная на отпуск запасов (З-2)(факсимиле)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
	КомандаПечати.Порядок = 68;
	// УНФ для Казахстана ---
	
	// УНФ для Казахстана
	//ВозможныеВарианты = Обработки.ПечатьТОРГ12.МатрицаВозможныхВариантов();
	//Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
	//	
	//	КомандаПечати = КомандыПечати.Добавить();
	//	КомандаПечати.Идентификатор = Обработки.ПечатьТОРГ12.ИдентификаторПечатнойФормы(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле);
	//	КомандаПечати.Представление = Обработки.ПечатьТОРГ12.ПредставлениеПФ(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле);
	//	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	//	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//	КомандаПечати.Порядок = 29;
	//	
	//	Если СтрокаТаблицы.ИспользоватьФаксимиле Тогда
	//		
	//		КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
	//		КомандаПечати.Порядок = КомандаПечати.Порядок + 1;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТН";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьТН";
	КомандаПечати.Представление = Обработки.ПечатьТН.ПредставлениеПФ();
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 30;
	
	// УНФ для Казахстана
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.СчетФактура";
	//КомандаПечати.Представление = Обработки.ПечатьСчетФактура.ПредставлениеПФ(Ложь, Ложь);
	//КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	//КомандаПечати.ФункциональныеОпции = "ПередачаТоваровНаКомиссию,ПриемТоваровНаКомиссию,ИспользуетсяОСНО,ИспользоватьСчетаФактурыИсходящие";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 35;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.УниверсальныйПередаточныйДокумент";
	//КомандаПечати.Представление = Обработки.ПечатьСчетФактура.ПредставлениеПФ(Истина, Ложь);
	//КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 35;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.УниверсальныйПередаточныйДокументФаксимиле";
	//КомандаПечати.Представление = Обработки.ПечатьСчетФактура.ПредставлениеПФ(Истина, Истина);
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	//КомандаПечати.МестоРазмещения = "ПодменюПечатьФаксимиле";
	//КомандаПечати.Порядок = 36;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 38;
	
	// УНФ для Казахстана
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ГарантийныйТалон";
	//КомандаПечати.Представление = НСтр("ru = 'Гарантийный талон'");
	//КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда,РеквизитыПечатиЗаказНаряд";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.ФункциональныеОпции = "ИспользоватьСерииНоменклатуры";
	//КомандаПечати.Порядок = 41;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СводныйОтчетЗаказНаряд";
	КомандаПечати.Представление = НСтр("ru = 'Сводно о заказ-наряде'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 44;
	
	// УНФ для Казахстана
	// Акт об оказании услуг (Р-1)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслугР1";
	КомандаПечати.Представление = НСтр("ru = 'Р-1 (Акт выполненных работ)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ФормаЗаказНаряда";
	КомандаПечати.Порядок = 63;
	
	// Акт об оказании услуг (Р-1) (С НДС)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслугР1_СНДС";
	КомандаПечати.Представление = НСтр("ru = 'Р-1 (Акт выполненных работ, с НДС)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ФормаЗаказНаряда";
	КомандаПечати.Порядок = 64;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "З2";
	КомандаПечати.Представление = НСтр("ru = 'Накладная на отпуск запасов (З-2)'");
	КомандаПечати.СписокФорм = "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ФормаЗаказНаряда";
	КомандаПечати.Порядок = 65;
	// УНФ для Казахстана ---
	
	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить(Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента);
	НазначенияШаблонов.Добавить(Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказНаряд);
	ШаблоныПечатиОфисныхДокументов.ДобавитьКомандыПечати(НазначенияШаблонов, КомандыПечати, "ФормаЗаказНаряда,ФормаСпискаЗаказНаряда", "КомандыПечатиДоговорКонтрагента", 99);
	
	
КонецПроцедуры                                       

функция ПечатнаяФормаВозврат (МассивОбъектов, ОбъектыПечати)         
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РешениеПоВозврату";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_РешениеПоВозврату";
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.mona_РешениеПоВозврату"); 
	Макет =ПолучитьОбщийМакет("mona_РешениеПоВозврату");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	              	|	ЗаказПокупателя.Дата КАК ДатаДокумента,
	              	|	ЗаказПокупателя.Номер КАК ДокументНомер,
	              	|	ЗаказПокупателя.Организация.Префикс КАК Префикс,
	              	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	              	|	ЗаказПокупателя.Организация КАК Организация,
	              	|	ЗаказПокупателя.КонтактноеЛицоПодписант.Наименование КАК КонтактноеЛицоПодписант,
	              	|	ЗаказПокупателя.mona_ПричинаОтказа КАК mona_ПричинаОтказа,
	              	|	ЗаказПокупателя.Запасы.(
	              	|		НомерСтроки КАК НомерСтроки,
	              	|		Номенклатура.Наименование КАК Запас,
	              	|		Номенклатура.Штрихкод КАК ПредставлениеКодаНоменклатуры,
	              	|		ЕдиницаИзмерения КАК ЕдиницаХранения,
	              	|		Количество КАК Количество,
	              	|		Цена КАК Цена,
	              	|		Сумма КАК Сумма
	              	|	) КАК ТаблицаЗапасы
	              	|ИЗ
	              	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	              	|ГДЕ
	              	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	              	|
	              	|УПОРЯДОЧИТЬ ПО
	              	|	Ссылка,
	              	|	НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало);
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.ДатаДокумента,,);
		СведенияОбКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Контрагент, ДанныеДокумента.ДатаДокумента,,);
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеДокумента.ДатаДокумента, ДанныеДокумента.ДокументНомер, ДанныеДокумента.Префикс);
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.номер_заказа = НомерДокумента;
		ОбластьЗаголовок.Параметры.дата_решения = Формат(ДанныеДокумента.ДатаДокумента, "ДФ='dd MMMM yyyy'");
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ИдентификационныйНомер,ЮридическийАдрес,Телефоны,");
		ОбластьЗаголовок.Параметры.номер_заказа =   ДанныеДокумента.ДокументНомер ;
		ОбластьЗаголовок.Параметры.дата_заказа =   Формат(ДанныеДокумента.ДатаДокумента, "ДФ='dd MMMM yyyy'");
		ОбластьЗаголовок.Параметры.решение = "отклонено";
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Для Каждого СтрокаЗапасы Из ДанныеДокумента.ТаблицаЗапасы Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаЗапасы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);     
		КонецЦикла;
	
		ПричинаОтказа = Макет.ПолучитьОбласть("ПричинаОтказа");
		ПричинаОтказа.Параметры.причина_отказа = ДанныеДокумента.mona_ПричинаОтказа;
		ТабличныйДокумент.Вывести(ПричинаОтказа);
		
		ОбластьКонтакт = Макет.ПолучитьОбласть("Контакт");
		ОбластьКонтакт.Параметры.контакт_поддержки = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИдентификационныйНомер,ЮридическийАдрес,Телефоны,ЭлектроннаяПочта");
		ТабличныйДокумент.Вывести(ОбластьКонтакт);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

&Вместо("Печать")
Процедура mona_Печать1(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
Перем Ошибки;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ЗаказПокупателя");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_ЗаказПокупателя";
		ПечатнаяФорма.ТабличныйДокумент.Автомасштаб = Истина;
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Заказ покупателя'");
		
		СформироватьЗаказПокупателя(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки);
		
	КонецЕсли;
	
	ВозможныеВарианты = Обработки.ПечатьСчетНаОплату.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьСчетНаОплату.ИдентификаторПечатнойФормы(СтрокаТаблицы.ЧастичнаяОплата, СтрокаТаблицы.ИспользоватьФаксимиле));
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
			ПечатнаяФорма.ТабличныйДокумент.Автомасштаб = Истина;
			ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
			ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.СинонимМакета(СтрокаТаблицы.ЧастичнаяОплата);
			
			ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, СтрокаТаблицы.ИспользоватьФаксимиле, Ошибки);
			Если СтрокаТаблицы.ЧастичнаяОплата Тогда
				
				Обработки.ПечатьСчетНаОплату.УчестьОсобенностиЧастичнойОплаты(ДанныеОбъектовПечати);
				
			КонецЕсли;
			
			Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, СтрокаТаблицы.ЧастичнаяОплата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Калькуляция");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_Калькуляция";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_Калькуляция";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Калькуляция'");
		
		СформироватьКалькуляцию(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "КалькуляцияСРазузлованием");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_КалькуляцияСРазузлованием";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_КалькуляцияСРазузлованием";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Калькуляция с разузлованием'");
		
		СформироватьКалькуляциюСРазузлованием(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СводныйОтчет");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = СформироватьСводныйОтчетЗаказПокупателя(МассивОбъектов, ОбъектыПечати, Ошибки);
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СводныйОтчет";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_СводныйОтчет";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='СводныйОтчет'");
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "КоммерческоеПредложение");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_КоммерческоеПредложение";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_КоммерческоеПредложение";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Коммерческое предложение'");
		
		СформироватьКоммерческоеПредложение(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ЗаказНаряд");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_ЗаказНаряд";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_ЗаказНаряд";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Заказ-наряд'");
		
		СформироватьЗаказНаряд(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки);
		
	КонецЕсли;
	
	ВозможныеВарианты = Обработки.ПечатьАктаОбОказанииУслуг.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьАктаОбОказанииУслуг.ИдентификаторПечатнойФормы(СтрокаТаблицы.Подробно, СтрокаТаблицы.ИспользоватьФаксимиле));
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьАктаОбОказанииУслуг.КлючПараметровПечати();
			ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьАктаОбОказанииУслуг.ПолныйПутьКМакету();
			ПечатнаяФорма.СинонимМакета = Обработки.ПечатьАктаОбОказанииУслуг.СинонимМакета(СтрокаТаблицы.Подробно);
			
			ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, СтрокаТаблицы.ИспользоватьФаксимиле, Ошибки);
			ДанныеОбъектовПечати.Колонки.Удалить("ДатаДокумента");
			ДанныеОбъектовПечати.Колонки.ДатаВыполненияРабот.Имя = "ДатаДокумента";
			
			Обработки.ПечатьАктаОбОказанииУслуг.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, СтрокаТаблицы.Подробно);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВозможныеВарианты = Обработки.ПечатьНакладная.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьНакладная.ИдентификаторПечатнойФормы(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле));
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьНакладная.КлючПараметровПечати();
			ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьНакладная.ПолныйПутьКМакету();
			ПечатнаяФорма.СинонимМакета = Обработки.ПечатьНакладная.СинонимМакета(СтрокаТаблицы.ВключаяУслуги);
			
			ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, СтрокаТаблицы.ИспользоватьФаксимиле, Ошибки);
			ДанныеОбъектовПечати.Колонки.Удалить("ДатаДокумента");
			ДанныеОбъектовПечати.Колонки.ДатаВыполненияРабот.Имя = "ДатаДокумента";
			
			Обработки.ПечатьНакладная.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, СтрокаТаблицы.ВключаяУслуги);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВозможныеВарианты = Обработки.ПечатьТОРГ12.МатрицаВозможныхВариантов();
	Для каждого СтрокаТаблицы Из ВозможныеВарианты Цикл
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьТОРГ12.ИдентификаторПечатнойФормы(СтрокаТаблицы.ВключаяУслуги, СтрокаТаблицы.ИспользоватьФаксимиле));
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьТОРГ12.КлючПараметровПечати();
			ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьТОРГ12.ПолныйПутьКМакету();
			ПечатнаяФорма.СинонимМакета = Обработки.ПечатьТОРГ12.СинонимМакета(СтрокаТаблицы.ВключаяУслуги);
			
			ДанныеОбъектовПечати = ДанныеДокументовРегУчет(МассивОбъектов, СтрокаТаблицы.ИспользоватьФаксимиле, Истина, Ошибки);
			Обработки.ПечатьТОРГ12.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, СтрокаТаблицы.ВключаяУслуги);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполнения");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = ДанныеДокументовБланкТоварногоНаполнения(МассивОбъектов);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ГарантийныйТалон");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = НоменклатураВДокументахСервер.ПечатьГарантийныйТалон(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГарантийныйТалон";
		ПечатнаяФорма.ПолныйПутьКМакету = "ОбщийМакет.ПФ_MXL_ГарантийныйТалон";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Гарантийный талон'");
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СводныйОтчетЗаказНаряд");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = СформироватьСводныйОтчетЗаказНаряд(МассивОбъектов, ОбъектыПечати, Ошибки);
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_СводныйОтчет";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_СводныйОтчет";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Сводный отчет'");
		
	КонецЕсли;
	
	Если ПараметрыПечати.Свойство("ШаблонПечатиОфисныхДокументов") И ЗначениеЗаполнено(ПараметрыПечати.ШаблонПечатиОфисныхДокументов) Тогда
		
		Для каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
			Если СтрНачинаетсяС(ПечатнаяФорма.ИмяВРЕГ, ВРег("ПечатьПоШаблонуОфисногоДокумента")) Тогда
				ПечатнаяФорма.ОфисныеДокументы = ПечатьПоШаблонуОфисногоДокумента(МассивОбъектов, ПараметрыПечати.ШаблонПечатиОфисныхДокументов);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// УНФ для Казахстана
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслугР1");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_АктОбОказанииУслугР1";
		ПечатнаяФорма.ПолныйПутьКМакету = "ОбщиеМакеты.ПФ_MXL_Р1";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Р-1 (Акт выполненных работ)'");
		
		СформироватьАктОбОказанииУслугР1(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслугР1_СНДС");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_АктОбОказанииУслугР1_СНДС";
		ПечатнаяФорма.ПолныйПутьКМакету = "ОбщиеМакеты.ПФ_MXL_Р1";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Р-1 (Акт выполненных работ, с НДС)'");
		
		СформироватьАктОбОказанииУслугР1(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Истина);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "З2");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_З2";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РасходнаяНакладная.ПФ_MXL_З2";
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Накладная на отпуск запасов (З-2)'");
		
		СформироватьЗ2(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	// УНФ для Казахстана ---
	
	// УНФ для Казахстана
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслугР1Факсимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_АктОбОказанииУслугР1Факсимиле";
		ПечатнаяФорма.ПолныйПутьКМакету = "ОбщиеМакеты.ПФ_MXL_Р1Факсимиле";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Р-1 (Акт выполненных работ)'");
		
		СформироватьАктОбОказанииУслугР1Факсимиле(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслугР1_СНДСФаксимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_АктОбОказанииУслугР1_СНДСФаксимиле";
		ПечатнаяФорма.ПолныйПутьКМакету = "ОбщиеМакеты.ПФ_MXL_Р1Факсимиле";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Р-1 (Акт выполненных работ, с НДС)'");
		
		СформироватьАктОбОказанииУслугР1Факсимиле(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Истина);
		
	КонецЕсли;
	
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "З2Факсимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_З2Факсимиле";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РасходнаяНакладная.ПФ_MXL_З2Факсимиле";
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Накладная на отпуск запасов (З-2)'");
		
		СформироватьЗ2Факсимиле(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	// УНФ для Казахстана ---  
	
     
    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "mona_РешениеПоВозврату");
    Если ПечатнаяФорма <> Неопределено Тогда
		    ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		    ПечатнаяФорма.ТабличныйДокумент = ПечатнаяФормаВозврат(МассивОбъектов, ОбъектыПечати);
            ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РешениеПоВозврату";
            ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.mona_РешениеПоВозврату";
            ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Решение по возврату'");
    КонецЕсли;

	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
		КоллекцияПечатныхФорм);
КонецПроцедуры