&После("ПриЗаписи")
Процедура mona_ПриЗаписи(Отказ)
	МенеджерЧтения = РегистрыСведений.ЗаказыОнлайн.СоздатьМенеджерЗаписи();
	МенеджерЧтения.Заказ = Ссылка;
	МенеджерЧтения.Прочитать();
	Изменить = Ложь;
	Если МенеджерЧтения.Выбран() Тогда	
		Если МенеджерЧтения.ВидЗаказа <> ВидЗаказа И Не ВидЗаказа = Неопределено И НЕ ВидЗаказа.Пустая() Тогда 
            МенеджерЧтения.ВидЗаказа = ВидЗаказа;
			Изменить = Истина;	
		КонецЕсли;	
		Если МенеджерЧтения.Телефон <> КонтактныйТелефон И Не КонтактныйТелефон = Неопределено И НЕ КонтактныйТелефон = ПустаяСтрока(КонтактныйТелефон) Тогда 
            МенеджерЧтения.Телефон = КонтактныйТелефон;
			Изменить = Истина;	
		КонецЕсли;	
		Если МенеджерЧтения.СостояниеЗаказа <> СостояниеЗаказа И Не СостояниеЗаказа = Неопределено И НЕ СостояниеЗаказа.Пустая() Тогда 
            МенеджерЧтения.СостояниеЗаказа = СостояниеЗаказа;
			Изменить = Истина;	
		КонецЕсли;	
		ЕстьСкоропорт = mona_ОбработкаИнтернетЗаказа.ЕстьСкоропорт(Ссылка);
		Если МенеджерЧтения.ЕстьСкоропорт <> ЕстьСкоропорт Тогда 
            МенеджерЧтения.ЕстьСкоропорт = ЕстьСкоропорт;
			Изменить = Истина;	
		КонецЕсли;	
		Если Изменить Тогда 
			МенеджерЧтения.Записать();       
		КонецЕсли;	
	КонецЕсли;  
КонецПроцедуры
