
&НаКлиенте
Процедура ОткрытьКассу() ЭКСПОРТ
	ОткрытьКассовуюСменуНаСервере(КассаККМ);
КонецПроцедуры                               

&НаКлиенте
Процедура ЗакрытьКассу() ЭКСПОРТ  
	ОписаниеОшибки = "";
	ЗакрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки);
КонецПроцедуры                          

&НаКлиенте
функция СтатусКассы() ЭКСПОРТ 
	СтруктураСостояниеКассовойСмены = РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);   
	Возврат СтруктураСостояниеКассовойСмены.СменаОткрыта;
КонецФункции