
&Перед("ДобавитьПарольВГлобальнуюПеременную")
Процедура mona_ДобавитьПарольВГлобальнуюПеременную(СохраняемыйКлюч, СохраняемоеЗначение)
	mona_ОбработкаИнтернетЗаказа.ВХран(СохраняемыйКлюч, СохраняемоеЗначение,"1СWebKassa_СоответствиеПользователяИПароля");
КонецПроцедуры

&Вместо("ОтправитьЗапросНаСервисWebkassa")
Функция mona_ОтправитьЗапросНаСервисWebkassa(АдресСервиса, ПутьОперации, ЗапросJSON)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(АдресСервиса, ПутьОперации, ЗапросJSON);
	// Вставить Запись в журнал внешних событий тип WebKassa
    // mona_ЖурналОбмена.ЗаписьWebKassa( ПутьОперации, ЗапросJSON);
	Возврат Результат;
КонецФункции
