
Функция ГенерацияТокенаGET(Запрос)

    ДанныеДляОтвета = Новый Структура("success", Истина);
	Попытка

          ТекПользователь = Пользователи.ТекущийПользователь();      

          Токен = Новый ТокенДоступа;

          Токен.Эмитент = "unf_kz_merge";

		  Токен.Получатели.Добавить("jwtAuth");
          Токен.Получатели.Добавить("mona_HTTP");

          Токен.КлючСопоставленияПользователя = ТекПользователь.Наименование;

          Токен.ВремяСоздания = ТекущаяУниверсальнаяДата() - Дата(1970,1,1,0,0,0);
		  
		  // 6 месяцев активность jwt
          Токен.ВремяЖизни = "15780096";

          Токен.ПолезнаяНагрузка.Вставить("universalDate", ТекущаяУниверсальнаяДата());

          Токен.ПолезнаяНагрузка.Вставить("userGUID", Строка(ТекПользователь.УникальныйИдентификатор()));       
          Токен.ПолезнаяНагрузка.Вставить("token_type", "access");     
                                                                                                                  
          Токен.Подписать(АлгоритмПодписиТокенаДоступа.HS256, Константы.mona_КлючПодписиТокенаДоступа.Получить());

          ДанныеДляОтвета.Вставить("token", Строка(Токен));

		  Возврат mona_ИнтеграцияМобильногоПриложения.Ответ(ДанныеДляОтвета);

     Исключение    
     
          ДанныеДляОтвета.success = Ложь;

          ДанныеДляОтвета.Вставить("Info", ОписаниеОшибки());

 		  Возврат mona_ИнтеграцияМобильногоПриложения.Ответ(ДанныеДляОтвета,400);

     КонецПопытки;


 КонецФункции

Функция ТестАвторизацииGET(Запрос)
	
	
	Ответ = Новый HTTPСервисОтвет(200);

     Попытка

          ТекПользователь = Пользователи.ТекущийПользователь();

          ТекстСообщения = СтрШаблон("Авторизация под пользователем %1 успешна",

                                 ТекПользователь.Наименование);

          ДанныеДляОтвета = Новый Структура;

          ДанныеДляОтвета.Вставить("success", Истина);

          ДанныеДляОтвета.Вставить("Info ", ТекстСообщения);

          ПараметрыJSON = Новый ПараметрыЗаписиJSON(, " ");

          ЗаписьJSON = Новый ЗаписьJSON;

          ЗаписьJSON.ПроверятьСтруктуру = Истина;

          ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);         

          ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтвета);

          СтрокаJSON = ЗаписьJSON.Закрыть();         

          Ответ.УстановитьТелоИзСтроки(СтрокаJSON);         

     Исключение             

          // Обработка ошибки

          Ответ = Новый HTTPСервисОтвет(400);

          ДанныеДляОтвета = Новый Структура;

          ДанныеДляОтвета.Вставить("success", Ложь);

          ДанныеДляОтвета.Вставить("Info", ОписаниеОшибки());         

          ПараметрыJSON = Новый ПараметрыЗаписиJSON(, " ");

          ЗаписьJSON = Новый ЗаписьJSON;

          ЗаписьJSON.ПроверятьСтруктуру = Истина;

          ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);         

          ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтвета);

          СтрокаJSON = ЗаписьJSON.Закрыть(); 

          Ответ.УстановитьТелоИзСтроки(СтрокаJSON);         

	  КонецПопытки;
	  Возврат ответ;
	 //ДанныеДляОтвета = Новый Структура("success,Info", Истина);

	 //Попытка

	 //     ТекПользователь = Пользователи.ТекущийПользователь();

	 //     ТекстСообщения = СтрШаблон("Авторизация под пользователем %1 успешна",

	 //                            ТекПользователь.Наименование);

	 //     ДанныеДляОтвета.Info = ТекстСообщения;

	 //	  Возврат mona_ИнтеграцияМобильногоПриложения.Ответ(ДанныеДляОтвета);

	 //Исключение             

	 //     // Обработка ошибки

	 //     ДанныеДляОтвета.success = Ложь;

	 //     ДанныеДляОтвета.Info = ОписаниеОшибки();

	 //     Возврат mona_ИнтеграцияМобильногоПриложения.Ответ(ДанныеДляОтвета,400);

	 //КонецПопытки;    

КонецФункции
