// Функция обрабатывает GET-запросы (Каталог, Карточка товара, Статус заказа)
Функция monaGET(Запрос)  Экспорт
	ДанныеЗапроса = mona_ИнтеграцияМобильногоПриложения.РазборЗапроса(Запрос);// ,"ПервыйУровень","ВторойУровень","ТретийУровень"
	
//	СтруктураОтвета = Новый Структура("status, data", "success");
	СтруктураОтвета = Новый Структура("data");
	КодСостояния = 200;
	отказ = Ложь;
	Если ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийКаталог() Тогда
		отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПолучитьКаталог(ДанныеЗапроса,СтруктураОтвета);
	ИначеЕсли ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийГруппа() Тогда
		отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПолучитьКаталог(ДанныеЗапроса,СтруктураОтвета,Истина);
	ИначеЕсли ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийВариант() Тогда
		отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПолучитьКаталог(ДанныеЗапроса,СтруктураОтвета);
	ИначеЕсли ДанныеЗапроса.Сценарий = "ping"  Тогда
		СтруктураОтвета.Вставить("message", "Все хорошо"); 
		СтруктураОтвета.Вставить("data", "mona mona"); 
	//ИначеЕсли ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийТовар() И ЗначениеЗаполнено(ДанныеЗапроса.Идентификатор) Тогда
	//	отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПолучитьКарточкуТовара(ДанныеЗапроса.Идентификатор,СтруктураОтвета);

	ИначеЕсли ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийЗаказы() И ЗначениеЗаполнено(ДанныеЗапроса.Идентификатор) Тогда
		отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПолучитьСтатусЗаказа(ДанныеЗапроса.Идентификатор,СтруктураОтвета);

	Иначе
		КодСостояния = 404;
		СтруктураОтвета.Вставить("message", "Сценарий не найден");
	КонецЕсли;
	Если отказ Тогда 
		СтруктураОтвета.Вставить("status","error");
		Возврат Ответ(СтруктураОтвета);
	КонецЕсли;	
	Возврат Ответ(СтруктураОтвета,КодСостояния);
КонецФункции

Функция Ответ(СтруктураОтвета,КодОтвета = 200)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	Возврат Ответ;

КонецФункции
// Функция обрабатывает POST-запросы (Прием заказа, Проверка зоны доставки)
Функция monaPOST(Запрос) Экспорт 
    отказ = Ложь;
	ДанныеЗапроса = mona_ИнтеграцияМобильногоПриложения.РазборЗапроса(Запрос);
	СтруктураОтвета = Новый Структура("status,order_id,message");
	Если ДанныеЗапроса.Сценарий = mona_ИнтеграцияМобильногоПриложения.СценарийЗаказы() Тогда
		// Сценарий: Приём заказа из приложения (с защитой от дублирования)
		Если НЕ (ДанныеЗапроса.Свойство("Команда")  И ДанныеЗапроса.Свойство("Идентификатор")) Тогда    // ДанныеЗапроса.Команда  = "create"
			IdempotencyKey = ДанныеЗапроса.Заголовки["Idempotency-Key"];
			Если ДанныеЗапроса.ПустойЗапрос Тогда 
	            КодСостояния = 400; 
				СтруктураОтвета.status 	 = "error"; 
				СтруктураОтвета.message  = "Пустое тело запроса";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","VALIDATION_ERROR","Пустое тело запроса")); 
			ИначеЕсли IdempotencyKey = Неопределено или ПустаяСтрока(IdempotencyKey) Тогда 
	            КодСостояния = 409; 
				СтруктураОтвета.status 	 = "error";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","IDEMPOTENCY_CONFLICT","Отсутствует ключ идемпотентности")); 
			ИначеЕсли mona_ИнтеграцияМобильногоПриложения.ОшибкаЗаполненияЗаказа(ДанныеЗапроса,СтруктураОтвета) Тогда 
	            КодСостояния = 400; 
		//		СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","VALIDATION_ERROR","Отстутствуют поля: "+ СтрокаНетПолей)); 
				СтруктураОтвета.status 	 = "error";
			ИначеЕсли mona_ИнтеграцияМобильногоПриложения.ОшибкаТоваровВЗаказе(ДанныеЗапроса,СтруктураОтвета) Тогда 
	            КодСостояния = 404; 
				СтруктураОтвета.status 	 = "error";
			ИначеЕсли mona_ИнтеграцияМобильногоПриложения.ОтсутствиеНаСкладе(ДанныеЗапроса,СтруктураОтвета) Тогда 
	            КодСостояния = 409; 
				СтруктураОтвета.status 	 = "error";
			Иначе         
				order_id = mona_ИнтеграцияМобильногоПриложения.ДубльОтПриложения("Idempotency_Key",IdempotencyKey);
				Если ПустаяСтрока(order_id) Тогда 
					отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ЗафиксироватьСозданиеНовогоЗаказа(ДанныеЗапроса,СтруктураОтвета); 
	                КодСостояния = 201;
				Иначе 
	            	КодСостояния = 409;    // для отладки 
					СтруктураОтвета.status 	 = "error";
					СтруктураОтвета.order_id = order_id; 
					СтруктураОтвета.message  = "Нарушение идемпотентности. Дублирование запроса создания заказа";
					СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","IDEMPOTENCY_CONFLICT","Дублирование ключа идемпотентности"));
					// нужно ли сравнивать тело ?
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ДанныеЗапроса.Свойство("Команда") и ДанныеЗапроса["Команда"] = "cancel" Тогда     // или сценарий платежи payment и идентификатор  confirm  Егор - установил квадратные скобки иначе   ДанныеЗапроса.Свойство("Команда")- возвращало истину
			IdempotencyKey = ДанныеЗапроса.Заголовки["Idempotency-Key"];
			Если ДанныеЗапроса.ПустойЗапрос Тогда 
	            КодСостояния = 400; 
				СтруктураОтвета.status 	 = "error"; 
				СтруктураОтвета.message  = "Пустое тело запроса";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","VALIDATION_ERROR","Пустое тело запроса")); 
			ИначеЕсли  IdempotencyKey = Неопределено или ПустаяСтрока(IdempotencyKey) Тогда 
	            КодСостояния = 409; 
				СтруктураОтвета.status 	 = "error";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","IDEMPOTENCY_CONFLICT","Отсутствует ключ идемпотентности")); 
				
			Иначе 	
				отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ЗафиксироватьОтменуЗаказа(ДанныеЗапроса,СтруктураОтвета); 
			КонецЕсли;	
		ИначеЕсли ДанныеЗапроса.Свойство("Команда") и ДанныеЗапроса["Команда"] = "payment" Тогда     // или сценарий платежи payment и идентификатор  confirm
			IdempotencyKey = ДанныеЗапроса.Заголовки["Idempotency-Key"];
			Если ДанныеЗапроса.ПустойЗапрос Тогда 
	            КодСостояния = 400; 
				СтруктураОтвета.status 	 = "error"; 
				СтруктураОтвета.message  = "Пустое тело запроса";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","VALIDATION_ERROR","Пустое тело запроса")); 
			ИначеЕсли  IdempotencyKey = Неопределено или ПустаяСтрока(IdempotencyKey) Тогда 
	            КодСостояния = 409; 
				СтруктураОтвета.status 	 = "error";
				СтруктураОтвета.Вставить("error",Новый Структура("code,mesage","IDEMPOTENCY_CONFLICT","Отсутствует ключ идемпотентности")); 
			Иначе 	
				отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ЗафиксироватьОплатуЗаказа(ДанныеЗапроса,СтруктураОтвета);
			КонецЕсли;
		ИначеЕсли ДанныеЗапроса.Свойство("Команда") и ДанныеЗапроса["Команда"] = "pay-refund" Тогда
			order_id = mona_ИнтеграцияМобильногоПриложения.ДубльОтПриложения("tiptoppay_id",ДанныеЗапроса);
			Если ПустаяСтрока(order_id) Тогда 
				отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ЗафиксироватьВозвратЗаказа(ДанныеЗапроса,СтруктураОтвета);
			Иначе 
 //           	КодСостояния = 409;    // для отладки 
				СтруктураОтвета.status 	 = "error";
				СтруктураОтвета.order_id = order_id; 
				СтруктураОтвета.message = "Дублирование запроса по возврату оплаты";
				СтруктураОтвета.Вставить("tiptoppay_id", ДанныеЗапроса.tiptoppay_id);
			КонецЕсли;
		ИначеЕсли ДанныеЗапроса.Свойство("Команда") и ДанныеЗапроса.Свойство("Команда")  = "check_delivery" Тогда     
				отказ = НЕ mona_ИнтеграцияМобильногоПриложения.ПроверкаДоступностиДоставки(ДанныеЗапроса,СтруктураОтвета);
		//ИначеЕсли ЗаказУжеСуществует(Идентификатор) Тогда
		//	// Если произошел сбой сети, но 1С уже создала заказ, просто возвращаем 200 ОК
		//	СтруктураОтвета.Вставить("message", "Заказ уже был успешно обработан ранее");
		Иначе
//			СоздатьЗаказПокупателяВУНФ(ДанныеЗапроса);
		КонецЕсли;
		
	ИначеЕсли ДанныеЗапроса.ПервыйУровень = "check-delivery" Тогда
		// Сценарий: Проверка доступности зоны доставки по координатам
		СтруктураОтвета.Вставить("available", mona_ИнтеграцияМобильногоПриложения.ПроверитьКоординатыДоставки(ДанныеЗапроса.latitude, ДанныеЗапроса.longitude));
		
	Иначе
		СтруктураОтвета.status = "error";
		Возврат Ответ(СтруктураОтвета,404);
	КонецЕсли;
	// если отказ
	Возврат Ответ(СтруктураОтвета);
	
КонецФункции



Функция ВерсияВерсия(Запрос)
	Возврат Ответ(Новый Структура("version","1.0"));
КонецФункции



