Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
    ОписаниеОтчета.ОпределитьИмяСхемыИВариантаПоУмолчанию = Ложь;
    ОписаниеОтчета.Схема = "ОсновнаяСхемаКомпоновкиДанных";

    ОписаниеОтчета.Вставить("Размещение", Новый Массив);
    ОписаниеОтчета.Размещение.Добавить(Метаданные.Подсистемы.Склад.Аналитика);

    ОписаниеОтчета.Вставить("Команды", Новый Массив);
    Команда = ОписаниеОтчета.Команды.Добавить();
    Команда.Представление = "Заказы с нулевым остатком номенклатуры";
    Команда.Идентификатор = "mona_ЗаказыСНулевымОстатком";
КонецПроцедуры