
&После("УстановкаПараметровСеанса")
Процедура mona_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	Если РольДоступна("mona_ОператорЗаказов") Тогда
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("РегистрСведений.ЗаказыОнлайн.Форма.ФормаНабораЗаписейТаймер"); 
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	КонецЕсли;
	Если РольДоступна("mona_Бухгалтер") Тогда
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("РегистрСведений.ЗаказыОнлайн.Форма.ФормаНабораЗаписейСинхронизация"); 
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	КонецЕсли;
КонецПроцедуры
