 
Процедура ЗаписьWebKassa(ПутьОперации, ЗапросJSON) Экспорт
	  ЖурналОбменаЗапись( Перечисления.mona_Источник.Webkassa,ПутьОперации, ЗапросJSON);
КонецПроцедуры	

 
Процедура ЗаписьМобильноеПриложение(ПутьОперации, ЗапросJSON) Экспорт
	  ЖурналОбменаЗапись(Перечисления.mona_Источник.МобильноеПриложение,ПутьОперации, ЗапросJSON);
КонецПроцедуры	


Процедура ЗаписьЯндексДоставка(ПутьОперации, ЗапросJSON) Экспорт
	  ЖурналОбменаЗапись(Перечисления.mona_Источник.ЯндексДоставка,ПутьОперации, ЗапросJSON);
КонецПроцедуры	



Процедура ЖурналОбменаЗапись(mona_Источник,ПутьОперации, ЗапросJSON) 
	Запись = РегистрыСведений.mona_ЖурналОбмена.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДатаСеанса();
	Запись.Источник = mona_Источник;  
//	ЗаписатьСобытие(
КонецПроцедуры
Процедура ЗаписатьСтатусЯндекс(СтатусДоставки,claim_id,Заказ) Экспорт
	ЗаписатьСобытие(
		Перечисления.mona_ТипСобытийОбмена.ОбновлениеСтатусаЯндекс,
		Перечисления.mona_НаправлениеОбмена.Входящее,
		Перечисления.mona_Источник.ЯндексДоставка,
		Перечисления.mona_Источник.Система,
		Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		Перечисления.mona_Статус.Успех,
		СтатусДоставки,
		Заказ,
		1,
		0,
		"", "", claim_id);	
КонецПроцедуры
Процедура ЗаписатьСобытие(
	ТипСобытия,
	НаправлениеОбмена,
	Источник,
	Получатель,
	Инициатор,
	Статус, 
	ТекстОшибки = "",
	ИсходныйДокумент = Неопределено,
	
	ЧислоПопыток = 1,

	СуммаОперации = 0,
	ИдПлатежнойСессии = "",
	tiptoppay_id = "",
	claim_id = "",
	ИдДокументаБухгалтерии = "") Экспорт 
	
	Набор = РегистрыСведений.mona_ЖурналОбмена.СоздатьНаборЗаписей();   

	НоваяЗапись = Набор.Добавить();

	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ТипСобытия = ТипСобытия;
	НоваяЗапись.НаправлениеОбмена = НаправлениеОбмена;
	НоваяЗапись.Источник = Источник;
	НоваяЗапись.Получатель = Получатель;
	НоваяЗапись.ИсходныйДокумент = ИсходныйДокумент;
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.ТекстОшибки = ТекстОшибки;
	НоваяЗапись.ЧислоПопыток = ЧислоПопыток;
	НоваяЗапись.Инициатор = Инициатор;
	НоваяЗапись.СуммаОперации = СуммаОперации;
	НоваяЗапись.ИдентификаторПлатежнойСессии = ИдПлатежнойСессии;
	НоваяЗапись.tiptoppay_id = tiptoppay_id;
	НоваяЗапись.claim_id = claim_id;
	НоваяЗапись.ИдентификаторДокументаБухгалтерии = ИдДокументаБухгалтерии;	            
	НоваяЗапись.НомерЗаписи = Строка(Новый УникальныйИдентификатор);
	
	//Набор.Записать(Ложь);
	Попытка
	Набор.Записать(Ложь);
Исключение 
	ЗаписьЖурналаРегистрации("mona_ЖурналОбмена", УровеньЖурналаРегистрации.Ошибка,,,"Не удалось записать событие в бизнес-журнал: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры