      
&НаКлиенте
Процедура mona_Синхронизация(Команда)
	  ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизацииДанных");
	  Элементы.Список.Обновить();
  КонецПроцедуры  

&НаКлиенте
Процедура mona_СвязанныеДокументы(Команда)
	 ТекДанные = Элементы.Список.ТекущиеДанные;
    Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Заказ) Тогда
        ПоказатьПредупреждение(, "Выберите заказ");
        Возврат;
    КонецЕсли;
    
    ПараметрыФормы = Новый Структура("ДокументСсылка", ТекДанные.Заказ);
    ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности", ПараметрыФормы);
КонецПроцедуры      

&НаКлиенте
Процедура mona_ЖурналРегистрации(Команда)   
	Отбор = Новый Структура;
    МассивУровней = Новый Массив;
    МассивУровней.Добавить("Ошибка");
    МассивУровней.Добавить("Предупреждение");
    Отбор.Вставить("Уровень", МассивУровней);
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Отбор", Отбор);
    
    ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыФормы);
    ПерейтиПоНавигационнойСсылке("e1cib/app/Обработка.ЖурналРегистрации");
КонецПроцедуры   

&НаКлиенте
Процедура mona_РезультатыОбмена(Команда)
    ОткрытьФорму("РегистрСведений.РезультатыОбменаДанными.Форма.Форма");
КонецПроцедуры
  
 &НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Заказ) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры    
 


