                                           
&Вместо("ОбработкаПолученияДанныхВыбора")
Процедура mona_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    // wein  {
	Если Параметры.Свойство("СостояниеЗаказа") Тогда 
		ВозможныеСостояния = mona_СтатусыЗаказов.ВозможныеСостояния(Параметры.СостояниеЗаказа);
	Иначе 
		ПродолжитьВызов(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	КонецЕсли;
    // wein  }
	СтандартнаяОбработка = Ложь;

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Параметры.Вставить("ВидЗаказа", Справочники.ВидыЗаказовПокупателей.Основной);
	КонецЕсли;

	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементовБыстрогоВыбора = 15;
	ДобавлятьПорядок = Истина;

	Если Параметры.Свойство("АвтоПодбор") И Параметры.АвтоПодбор = Истина Тогда 
		ДобавлятьПорядок = Ложь;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 15
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
		|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
		|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.Наименование ПОДОБНО &Наименование
		|	И НЕ СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");

	ИначеЕсли Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда

		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 15
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Наименование КАК Наименование,
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Цвет КАК Цвет
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &ВидЗаказа
		|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";

		Запрос.УстановитьПараметр("ВидЗаказа", Параметры.ВидЗаказа);

	Иначе

		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 15
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
		|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
		|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";

		ДобавлятьПорядок = Ложь;

	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "15", КоличествоЭлементовБыстрогоВыбора);
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 0;
	ЖирныйШрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	Пока Выборка.Следующий() Цикл
	    // wein {
		Если Параметры.Свойство("СостояниеЗаказа") и ВозможныеСостояния <> Неопределено  Тогда 
			Если  ВозможныеСостояния.Количество() = 0 Тогда 
				Если Выборка.Состояние <> Параметры.СостояниеЗаказа Тогда
					Продолжить; 
				КонецЕсли;	
			ИначеЕсли ВозможныеСостояния.Найти(Строка(Выборка.Состояние)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
	    // wein }
			
		НомерПоПорядку = НомерПоПорядку + 1;
		Цвет = Выборка.Цвет.Получить();
		Если Цвет = Неопределено Тогда
			Цвет = ЦветаСтиля.ЦветТекстаПоля;
		КонецЕсли;

		КомпонентыФС = Новый Массив;
		Если ДобавлятьПорядок Тогда
			КомпонентыФС.Добавить(Строка(НомерПоПорядку) + ". ");
		КонецЕсли;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Выборка.Наименование,
		?(Выборка.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен, ЖирныйШрифт, Неопределено),
		Цвет));

		ДанныеВыбора.Добавить(Выборка.Состояние, Новый ФорматированнаяСтрока(КомпонентыФС));	// АПК:1356 Используются локализованные имена состояний

	КонецЦикла;

КонецПроцедуры