
&Вместо("ДобавитьКомандыПечати")
Процедура mona_ДобавитьКомандыПечати(КомандыПечати)
	// УНФ для Казахстана - закомментировано	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "НакладнаяСРасходами";
	//КомандаПечати.Представление = НСтр("ru = 'Приходная накладная (с услугами)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 4;
	//
	//// МобильноеПриложение
	//Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
	//	Возврат;
	//КонецЕсли;
	//// Конец МобильноеПриложение
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("ru = 'Приходная накладная'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	// УНФ для Казахстана
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "З1";
	КомандаПечати.Представление = НСтр("ru = 'Приходный ордер (З-1)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НакладнаяВРозничныхЦенах";
	КомандаПечати.Представление = НСтр("ru = 'Приходная накладная (в розничных ценах)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 7;  
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "mona_РешениеПоВозврату";
	КомандаПечати.Представление = НСтр("ru = 'Решение по возврату'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 25;        
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "mona_АктОПризнании";
	КомандаПечати.Представление = НСтр("ru = 'Акт о признании товара ненадлежащего качества'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 27;   
	
	// УНФ для Казахстана
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = Обработки.ПечатьМХ1.ИдентификаторПечатнойФормы();
	//КомандаПечати.Представление = Обработки.ПечатьМХ1.ПредставлениеПФ();
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.ФункциональныеОпции = "ПриемЗапасовНаОтветХранение";
	//КомандаПечати.Порядок = 10;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 14;    
	
	Если ПравоДоступа("Просмотр", Метаданные.Обработки.ПечатьЭтикетокИЦенников)
		И ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников")
		И НЕ УправлениеДоступомУНФ.ЕстьПрофильРабочееМестоКассира() Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЭтикетокИзПриходнойНакладной";
		КомандаПечати.Представление = НСтр("ru = 'Печать этикеток'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 17;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЦенниковИзПриходнойНакладной";
		КомандаПечати.Представление = НСтр("ru = 'Печать ценников'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 20;   
		
	КонецЕсли;
	
	// УНФ для Казахстана
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.СчетФактураПолученный";
	//КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (полученный)'");;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 23;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.СчетФактураВозвратОтПокупателя";
	//КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (Корректировочный)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 24;
	// УНФ для Казахстана ---
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Конверт";
	КомандаПечати.Представление = НСтр("ru = 'Конверт'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонверта";
	КомандаПечати.Порядок = 26;
КонецПроцедуры


&Вместо("Печать")
Процедура mona_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", НСтр("ru = 'Приходная накладная'"), ПечатнаяФормаНакладная(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяСРасходами") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяСРасходами", НСтр("ru = 'Приходная накладная (с расходами)'"), ПечатнаяФормаНакладнаяСРасходами(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	// УНФ для Казахстана
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "З1") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "З1", "Приходный ордер (З-1)", ПечатнаяФорма_З1(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	// УНФ для Казахстана ---
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяВРозничныхЦенах") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяВРозничныхЦенах", НСтр("ru = 'Приходная накладная'"), ПечатнаяФормаНакладнаяВРозничныхЦенах(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;   
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "mona_РешениеПоВозврату") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "mona_РешениеПоВозврату", НСтр("ru = 'Решение по возврату'"), ПечатнаяФормаВозврат(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;  
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "mona_АктОПризнании") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "mona_АктОПризнании", НСтр("ru = 'Акт о признании товара ненадлежащего качества'"), ПечатнаяФормаАктНенадлежащегоКачества(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;  
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьМХ1.ИдентификаторПечатнойФормы());
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьМХ1.КлючПараметровПечати();
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = Обработки.ПечатьМХ1.ПолныйПутьКМакету();
		ОписаниеПечатнойФормы.СинонимМакета = Обработки.ПечатьМХ1.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов);
		Обработки.ПечатьМХ1.СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполнения");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ОписаниеПечатнойФормы.СинонимМакета = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов,
	КоллекцияПечатныхФорм);
КонецПроцедуры 

Функция ПечатнаяФормаВозврат(МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РешениеПоВозврату";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходнаяНакладная_РешениеПоВозврату";
	Макет = ПолучитьОбщийМакет("mona_РешениеПоВозврату"); 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.Дата КАК ДатаДокумента,
	|	ПриходнаяНакладная.Номер КАК ДокументНомер,
	|	ПриходнаяНакладная.Организация.Префикс КАК Префикс,
	|	ПриходнаяНакладная.Контрагент КАК Контрагент,
	|	ПриходнаяНакладная.Организация КАК Организация,
	|	ПриходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК КонтактноеЛицоПодписант,
	|	ПриходнаяНакладная.mona_РешениеПоВозврату КАК mona_РешениеПоВозврату,
	|	ПриходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Наименование КАК Запас,
	|		Номенклатура.Штрихкод КАК ПредставлениеКодаНоменклатуры,
	|		ЕдиницаИзмерения КАК ЕдиницаХранения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК ТаблицаЗапасы,
	|	ПриходнаяНакладная.Заказ КАК Заказ
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало);
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.ДатаДокумента,,);
		СведенияОбКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Контрагент, ДанныеДокумента.ДатаДокумента,,);
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеДокумента.ДатаДокумента, ДанныеДокумента.ДокументНомер, ДанныеДокумента.Префикс);
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.номер_заказа = НомерДокумента;
		ОбластьЗаголовок.Параметры.дата_решения = Формат(ДанныеДокумента.ДатаДокумента, "ДФ='dd MMMM yyyy'");
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ИдентификационныйНомер,ЮридическийАдрес,Телефоны,");
		ОбластьЗаголовок.Параметры.номер_заказа =   ДанныеДокумента.Заказ.Номер ;
		ОбластьЗаголовок.Параметры.дата_заказа =   Формат(ДанныеДокумента.Заказ.Дата, "ДФ='dd MMMM yyyy'");
		ОбластьЗаголовок.Параметры.решение = ДанныеДокумента.mona_РешениеПоВозврату;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Для Каждого СтрокаЗапасы Из ДанныеДокумента.ТаблицаЗапасы Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаЗапасы); 
			ТабличныйДокумент.Вывести(ОбластьСтрока);     
		КонецЦикла;
		
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		ОбластьИтого.Параметры.сумма_возврата =  ДанныеДокумента.ТаблицаЗапасы.Итог("Сумма");
		ТабличныйДокумент.Вывести(ОбластьИтого);     
		
		СрокЗачисления = Макет.ПолучитьОбласть("СрокЗачисления");
		ТабличныйДокумент.Вывести(СрокЗачисления);
		
		ОбластьКонтакт = Макет.ПолучитьОбласть("Контакт");
		ОбластьКонтакт.Параметры.контакт_поддержки = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИдентификационныйНомер,ЮридическийАдрес,Телефоны,ЭлектроннаяПочта");
		ТабличныйДокумент.Вывести(ОбластьКонтакт);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции                                      

Функция ПечатнаяФормаАктНенадлежащегоКачества(МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОПризнании";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходнаяНакладная_АктОПризнании";
	Макет = ПолучитьОбщийМакет("mona_АктОПризнании"); 	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.Дата КАК ДатаДокумента,
	|	ПриходнаяНакладная.Номер КАК ДокументНомер,
	|	ПриходнаяНакладная.Организация.Префикс КАК Префикс,
	|	ПриходнаяНакладная.Контрагент КАК Контрагент,
	|	ПриходнаяНакладная.Организация КАК Организация,
	|	ПриходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК КонтактноеЛицоПодписант,
	|	ПриходнаяНакладная.mona_РешениеПоВозврату КАК mona_РешениеПоВозврату,
	|	ПриходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Наименование КАК Запас,
	|		Номенклатура.Штрихкод КАК ПредставлениеКодаНоменклатуры,
	|		ЕдиницаИзмерения КАК ЕдиницаХранения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Номенклатура.mona_Бренд КАК Производитель,
	|		СерииНоменклатуры КАК СерияНом
	|	) КАК ТаблицаЗапасы,
	|	ПриходнаяНакладная.Заказ КАК Заказ,
	|	ПриходнаяНакладная.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало);
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.ДатаДокумента,,);
		СведенияОбКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ДанныеДокумента.Контрагент, ДанныеДокумента.ДатаДокумента,,);
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеДокумента.ДатаДокумента, ДанныеДокумента.ДокументНомер, ДанныеДокумента.Префикс);
		АдресТочки = ПолучитьАдресПоСтруктурнойЕдинице(ДанныеДокумента.СтруктурнаяЕдиница);
		
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");   
		ОбластьЗаголовок.Параметры.номер_заявки = ДанныеДокумента.Заказ.Номер ;
		//ОбластьЗаголовок.Параметры.номер_заявки = НомерДокумента;                     
		ОбластьЗаголовок.Параметры.Адрес = АдресТочки; 
		ОбластьЗаголовок.Параметры.дата_решения = Формат(ДанныеДокумента.ДатаДокумента, "ДФ='dd MMMM yyyy'");
		ОбластьЗаголовок.Параметры.Час = Формат(ТекущаяДата(), "ДФ='HH'"); 
		ОбластьЗаголовок.Параметры.Минута = Формат(ТекущаяДата(), "ДФ='mm'");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьСведенияОПродавце = Макет.ПолучитьОбласть("СведенияОПродавце"); 
		ОбластьСведенияОПродавце.Параметры.Продавец =  ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование, ИдентификационныйНомер");
		
		ОбластьСведенияОПродавце.Параметры.ПокупательФИО = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование"); 
		ТелефонКонтрагента = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбКонтрагенте, "Телефоны,ЭлектроннаяПочта,");
		Если ТелефонКонтрагента <> "" Тогда
			ОбластьСведенияОПродавце.Параметры.ПокупательКонтакт = ПечатьДокументовУНФ.ОписаниеОрганизации(СведенияОбКонтрагенте, "Телефоны,ЭлектроннаяПочта,");
		Иначе
			ОбластьСведенияОПродавце.Параметры.ПокупательКонтакт = "Телефон/e-mail (при необходимости): ______________________________"; 
		КонецЕсли ;
		
		Если  ДанныеДокумента.Заказ.Пустая() Тогда
			ОбластьСведенияОПродавце.Параметры.номер_заказа = "____________________";     
			ОбластьСведенияОПродавце.Параметры.дата_заказа = "«___» __________ 20___ ";
		Иначе 
			ОбластьСведенияОПродавце.Параметры.номер_заказа = ДанныеДокумента.Заказ.Номер ;
			ОбластьСведенияОПродавце.Параметры.дата_заказа = Формат(ДанныеДокумента.Заказ.Дата, "ДФ='dd MMMM yyyy'");
		КонецЕсли ;                                          
		
		ОбластьСведенияОПродавце.Параметры.Адрес = АдресТочки;
		
		ДатаДок = Формат(ДанныеДокумента.ДатаДокумента, "ДФ='dd MMMM yyyy'");
		Шаблон =  ДатаДок + "г. [ ] приложение [ ] магазин  [ ] e-mail  [ ] иное ____________________________________________________________";
		ОбластьСведенияОПродавце.Параметры.ДатаДокумента = Шаблон; 
		
		ТабличныйДокумент.Вывести(ОбластьСведенияОПродавце); 
		
		ОбластьИдентификацияТовара = Макет.ПолучитьОбласть("ИдентификацияТовара");
		ТабличныйДокумент.Вывести(ОбластьИдентификацияТовара);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Для Каждого СтрокаЗапасы Из ДанныеДокумента.ТаблицаЗапасы Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаЗапасы);  
			
			Если ЗначениеЗаполнено(СтрокаЗапасы.СерияНом) Тогда
				СтрокаСерии = Строка(СтрокаЗапасы.СерияНом);
				ПозОт = Найти(СтрокаСерии, "от ");
				ПозДо = Найти(СтрокаСерии, "до ");
				Если ПозОт > 0 Тогда
					ОбластьСтрока.Параметры.Серия = Лев(СтрокаСерии, ПозОт - 1);
				Иначе
					ОбластьСтрока.Параметры.Серия = СтрокаСерии;
				КонецЕсли;          
				
				Если ПозОт > 0 И ПозДо > 0 Тогда
					ДатаПроизводстваСтр = Сред(СтрокаСерии, ПозОт + 3, 10);
					СрокГодностиСтр = Сред(СтрокаСерии, ПозДо + 3, 10);
					ОбластьСтрока.Параметры.ДатаИзготовления = ДатаПроизводстваСтр;
					ОбластьСтрока.Параметры.СрокГодности = СрокГодностиСтр;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);     
		КонецЦикла;
		
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		ОбластьИтого.Параметры.Итого =  ДанныеДокумента.ТаблицаЗапасы.Итог("Сумма");
		ТабличныйДокумент.Вывести(ОбластьИтого);    
		
		ОбластьСостояниеТовара = Макет.ПолучитьОбласть("СостояниеТовара");
		ТабличныйДокумент.Вывести(ОбластьСостояниеТовара);
		
		ОбластьРезультатПроверки = Макет.ПолучитьОбласть("РезультатПроверки");
		ТабличныйДокумент.Вывести(ОбластьРезультатПроверки);
		
		ОбластьТребованиеПокупателя = Макет.ПолучитьОбласть("ТребованиеПокупателя");
		ТабличныйДокумент.Вывести(ОбластьТребованиеПокупателя);
		
		ОбластьРешениеПродавца = Макет.ПолучитьОбласть("РешениеПродавца");
		ТабличныйДокумент.Вывести(ОбластьРешениеПродавца);   
		
		ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");
		ТабличныйДокумент.Вывести(ОбластьПриложение); 
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьПодписи); 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьАдресПоСтруктурнойЕдинице(СтруктурнаяЕдиница)
	Если СтруктурнаяЕдиница = ПустаяСсылка() Тогда
		Возврат "";
	КонецЕсли;
	
	Родитель = СтруктурнаяЕдиница.Родитель;
	Если Родитель = ПустаяСсылка() Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    ТочкиОтгрузки.Адрес КАК Адрес
	|ИЗ
	|    Справочник.mona_ТочкиОтгрузки КАК ТочкиОтгрузки
	|ГДЕ
	|    ТочкиОтгрузки.ОсновнаяТочка = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Адрес;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции    

Процедура ПриПодготовкеШаблонаСообщения(РеквизитыОбъектаНазначения, Вложения, ПараметрыШаблона) Экспорт
КонецПроцедуры 

Процедура ПриФормированииСообщения(Сообщение, Предмет, ПараметрыШаблона) Экспорт    
		Если ТипЗнч(Предмет) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Номер КАК НомерПриходнойНакладной,
		|	ПриходнаяНакладная.Контрагент.Наименование КАК Поставщик,
		|	ПриходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
		|	ПриходнаяНакладная.Заказ.Номер КАК НомерЗаказа,
		|	КонтактТелефон.НомерТелефона КАК ТелефонПоддержки,
		|	КонтактEmail.АдресЭП КАК EmailПоддержки,
		|	ЗаказыОнлайн.order_number КАК НомерИзПриложения
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК КонтактТелефон
		|		ПО (КонтактТелефон.Ссылка = ПриходнаяНакладная.Заказ.Организация)
		|			И (КонтактТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК КонтактEmail
		|		ПО (КонтактEmail.Ссылка = ПриходнаяНакладная.Заказ.Организация)
		|			И (КонтактEmail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыОнлайн КАК ЗаказыОнлайн
		|		ПО (ЗаказыОнлайн.Заказ = ПриходнаяНакладная.Заказ)
		|ГДЕ
		|	ПриходнаяНакладная.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Предмет);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			// Записываем значения прямо в подстановки письма
			Сообщение.ЗначенияРеквизитов["НомерЗаказа"] = Результат.НомерЗаказа;
			Сообщение.ЗначенияРеквизитов["Контрагент"] = Результат.Поставщик;
			Сообщение.ЗначенияРеквизитов["СуммаДокумента"] = Результат.СуммаДокумента;
			Сообщение.ЗначенияРеквизитов["НомерПриходнойНакладной"] = Результат.НомерПриходнойНакладной;
			Сообщение.ЗначенияРеквизитов["ТелефонПоддержки"] = Результат.ТелефонПоддержки;
			Сообщение.ЗначенияРеквизитов["EmailПоддержки"] = Результат.EmailПоддержки; 
			Сообщение.ЗначенияРеквизитов["НомерИзПриложения"] = Результат.НомерИзПриложения;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры      

Процедура ПриЗаполненииПочтыПолучателейВСообщении(Получатели, ПредметСообщения) Экспорт
КонецПроцедуры