&НаСервере
Процедура УстановитьКонстанты()
	ИменаКонстант = Новый Массив;
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки");
	ИменаКонстант.Добавить("ИспользоватьВидыЗаказовПокупателей");
	ИменаКонстант.Добавить("ИспользоватьСерииНоменклатуры");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьСборкуЗаказов");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьПодключаемоеОборудование");
// ?	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьПредоплатуВЧекахККМ"); 
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговле");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьСборкуЗаказовНаПеремещение");
	ИменаКонстант.Добавить("ИспользоватьОбменСПодключаемымОборудованиемOffline");
	ИменаКонстант.Добавить("ФункциональнаяОпцияУчетРозничныхПродаж");
	ИменаКонстант.Добавить("ИспользоватьНовоеРМК");
	ИменаКонстант.Добавить("ИспользоватьТолькоНовыйРМК");
	ИменаКонстант.Добавить("ИспользоватьРасширенныйРежимНастройкиУРМК");
	ИменаКонстант.Добавить("КонтролироватьОстаткиПриПробитииЧековККМ");
	ИменаКонстант.Добавить("ИспользоватьНесколькоОрганизаций");
	ИменаКонстант.Добавить("ФункциональнаяОпцияУчетПоНесколькимСкладам");
	ИменаКонстант.Добавить("ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников");
	ИменаКонстант.Добавить("ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером");
//	ИменаКонстант.Добавить("ПервоначальнаяНастройкаЗаполненыСведенияОбОрганизации");
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		МенеджерКонстанты = Константы[ИмяКонстанты];
		Если Не МенеджерКонстанты.Получить() Тогда
			МенеджерКонстанты.Установить(Истина);
		КонецЕсли;
	КонецЦикла; 
	Константы["НеИспользоватьНесколькоОрганизаций"].Установить(Ложь);
	Константы["НеИспользоватьВидыЗаказовПокупателей"].Установить(Ложь);   
КонецПроцедуры
&НаСервере
Процедура ПередЗапускомПрограммы() Экспорт 
	УстановитьКонстанты();
	Точка = Справочники.mona_ТочкиОтгрузки.ПоУмолчанию(); // для проверки заполнения;
	Если ВидЗаказаИнтернет() = Неопределено Тогда
		Сообщить("Не определен вид заказа для онлайн торговли")
	КонецЕсли;	
	Если ВидЗаказаИнтернет("ПВЗ") = Неопределено Тогда
		Сообщить("Не определен вид заказа для ПВЗ как: 'ПВЗ'");
	КонецЕсли;
	Узел = ПланыОбмена.ИнтеграцияСИнтернетМагазиномТовары.НайтиПоКоду("NN");
	
	//проверить наличие категорий
	
КонецПроцедуры


&НаСервере
Функция ВидЗаказаИнтернет(ИмяИнтернетЗаказа = "Интернет-заказ") Экспорт
	Если ИмяИнтернетЗаказа = "piсkup" Тогда  
		 ИмяИнтернетЗаказа = "ПВЗ";
	КонецЕсли;	
	возврат Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию(ИмяИнтернетЗаказа);  //"Интернет-заказ","ПВЗ" 
КонецФункции
&НаСервере
Функция ВидЗаказаПВЗ() Экспорт
	возврат ВидЗаказаИнтернет("ПВЗ");  //"Интернет-заказ","ПВЗ" 
КонецФункции
&НаКлиенте
Функция ПВЗ() Экспорт
	возврат ВидЗаказаИнтернет("ПВЗ");  //"Интернет-заказ","ПВЗ" 
КонецФункции


Функция ЕстьСкоропорт(СсылкаЗаказа) Экспорт
	Для Каждого стр из СсылкаЗаказа.Запасы Цикл 
		Если ЯвляетсяСкоропортом(стр.Номенклатура) Тогда  
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ЯвляетсяСкоропортом(Номенклатура) Экспорт 
	Если Номенклатура = Неопределено Или ТипЗнч(Номенклатура)<> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Категория = Номенклатура.КатегорияНоменклатуры;
	ЯвляетсяСкоропортом = Ложь;
	Если ЗначениеЗаполнено(Категория) Тогда
		ЯвляетсяСкоропортом = (Категория.mona_Скоропортящийся = ИСТИНА
		ИЛИ Категория.Наименование = "Замороженное" 
		ИЛИ Категория.Наименование = "Охлажденное"); 
	КонецЕсли;
	Возврат ЯвляетсяСкоропортом;
КонецФункции

Функция ОпределитьЧастиЗаказа(Объект) Экспорт
	Запасы = Объект.Запасы;
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ЗаказПокупателяЗапасы.Номенклатура.КатегорияНоменклатуры.mona_Скоропортящийся КАК Скоропортящийся,
	//|	ЗаказПокупателяЗапасы.Номенклатура.КатегорияНоменклатуры.Наименование КАК КатегорияНаименование
	//|ИЗ
	//|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	//|ГДЕ
	//|	ЗаказПокупателяЗапасы.Ссылка = &Заказ";
	//Запрос.УстановитьПараметр("Заказ", СсылкаЗаказа);
	//
	//Результат = Новый Структура("ЕстьСухаяЧасть, ЕстьХолоднаяЧасть", Ложь, Ложь);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//    ЯвляетсяСкоропортом = Выборка.Скоропортящийся = Истина
	//    ИЛИ Выборка.КатегорияНаименование = "Замороженное"
	//    ИЛИ Выборка.КатегорияНаименование = "Охлажденное";
	//    Если ЯвляетсяСкоропортом Тогда
	//   	 Результат.ЕстьХолоднаяЧасть = Истина;
	//    Иначе
	//   	 Результат.ЕстьСухаяЧасть = Истина;
	//    КонецЕсли;
	//КонецЦикла;
	//Возврат Результат; 
	Результат = Новый Структура("ЕстьСухаяЧасть, ЕстьХолоднаяЧасть", Ложь, Ложь);
	Для Каждого Стр Из Запасы Цикл 
		ЯвляетсяСкоропортом = ЯвляетсяСкоропортом(Стр.Номенклатура);
		Если ЯвляетсяСкоропортом Тогда
			Результат.ЕстьХолоднаяЧасть = Истина;
		Иначе
			Результат.ЕстьСухаяЧасть = Истина;
		КонецЕсли;
		
		Если Результат.ЕстьСухаяЧасть И Результат.ЕстьХолоднаяЧасть Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;  
	Возврат Результат;
КонецФункции



Функция ЗаполнитьПоТочкеОтгрузки(ДокОбъект) Экспорт
	Если ДокОбъект.ПоложениеСклада <> Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда 
		ДокОбъект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	КонецЕсли;	 
	ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	ДокОбъект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	ДокОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
	ВалютаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.ВалютаДокумента, ДокОбъект.Дата);
	ДокОбъект.Курс = ВалютаКурсКратность.Курс;
	ДокОбъект.Кратность = ВалютаКурсКратность.Кратность;
	
	Если ДокОбъект.ВидЗаказа = ВидЗаказаИнтернет() или 
		ДокОбъект.ВидЗаказа = ВидЗаказаИнтернет("ПВЗ") Тогда 
		ТочкиОтгрузки = Справочники.mona_ТочкиОтгрузки.Выбрать();
		Если ТочкиОтгрузки.Следующий() Тогда 
			Если ДокОбъект.СтруктурнаяЕдиницаРезерв <> ТочкиОтгрузки.Склад  Тогда 
				ДокОбъект.СтруктурнаяЕдиницаРезерв = ТочкиОтгрузки.Склад;
			КонецЕсли;
			ДокОбъект.ВидЦен = ТочкиОтгрузки.ВидЦеныОнлайн;
		КонецЕсли;
	КонецЕсли; 
	//Заполнение для Доставки 
	Если ДокОбъект.ВидЗаказа = ВидЗаказаИнтернет() Тогда       
		ДокОбъект.СлужбаДоставки = ТочкиОтгрузки.СлужбаДоставки;  
		ДокОбъект.Грузоотправитель = ДокОбъект.Организация; 
	КонецЕсли;	
КонецФункции


Процедура ЗаполнитьДоставку(ДокОбъект,Самовывоз = Ложь,Результат = Неопределено) Экспорт;
	Сообщение = "";
	Если ДокОбъект.mona_ТочкаОтгрузки.Пустая() Тогда 
    	 ДокОбъект.mona_ТочкаОтгрузки = Справочники.mona_ТочкиОтгрузки.ПоУмолчанию();
	КонецЕсли;
	Если Самовывоз Тогда
		ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз; 
	// Нужно ли что-то очистить ?	
	Иначе    
		ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Курьер; 
		ДокОбъект.СлужбаДоставки = ДокОбъект.mona_ТочкаОтгрузки.СлужбаДоставки;
		ДокОбъект.НоменклатураДоставки = Справочники.Номенклатура.НайтиПоНаименованию("Доставка"); 
		ДокОбъект.СтавкаНДСДоставки = Справочники.СтавкиНДС.СтавкаНДС(ДокОбъект.НоменклатураДоставки.ВидСтавкиНДС);
	// + перерасчет суммы доставки и суммы документа
		Если ДокОбъект.mona_Широта = 0 или ДокОбъект.mona_Долгота = 0 Тогда
			Сообщение = Сообщение + "Не указаны координаты получателя; "; 
		КонецЕсли;
		Если ПустаяСтрока(ДокОбъект.АдресДоставки)  Тогда
			Сообщение = Сообщение + "Не указаны адрес доставки; "; 
		КонецЕсли;
		Если ПустаяСтрока(ДокОбъект.КонтактныйТелефон)  Тогда
			Сообщение = Сообщение + "Не указаны контакный телефон получателя; "; 
		КонецЕсли; 
	КонецЕсли; 
	// Проверить и заполнить остальные поля
	Если Не ПустаяСтрока(Сообщение) Тогда 
		Если Не Результат = Неопределено Тогда 
        	Результат.Сообщение = Сообщение;	
		КонецЕсли;	
		Сообщить(Сообщение);
	КонецЕсли; 
	Возврат;
КонецПроцедуры
&НаСервере
Функция ПрочитатьJSONизХранилища(Хран)
	ЧтениеJSON = Новый	ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Хран.Получить());
	ДанныеЗаказа = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();	 
	Возврат ДанныеЗаказа;
КонецФункции

&НаСервере
Процедура СоздатьЗаказНаСервере2() Экспорт 
	СтрокаJSON = "{" +
             """order_number"": 24," +
             """created_at"": ""2026-07-23T16:17:45+03:00""," +
             """recipient"": {""full_name"": ""Розничный покупатель""," +
             """phone"": """",""email"": """"}," +
             """delivery_method"": """"," +
             """delivery_address"": {""address"": """"," +
             """coordinates"": {""latitude"": 0,""longitude"": 0}," +
             """courier_comment"": """"}," +
             """time_slot"": ""01.01.0001 0:00:00-01.01.0001 0:00:00""," +
             """payment_method"": ""card_online""," +
             """items"": [" +
             "{""scan_id"": ""2_0000900000_""," +
             """item_id"": ""4faecfce-3ca4-11f1-8daa-000c297312bc""," +
             """name"": ""Ветчина из мяса индейки, вес""," +
             """quantity"": 1,""price"": 1764}," +
             "{""scan_id"": ""4870248140679""," +
             """item_id"": ""26cbb576-4467-11f1-8daa-000c297312bc""," +
             """name"": ""Котлеты Ragout из курицы с овощами готовые 300 г""," +
             """quantity"": 1,""price"": 3470}," +
             "{""scan_id"": ""2_0002600000_""," +
             """item_id"": ""5803ab2b-3984-11f1-a3c9-00155d148333""," +
             """name"": ""Конфеты Победа ваф. мишки в лесу в гор. шок. б/с, вес ""," +
             """quantity"": 1,""price"": 7200}," +
             "{""scan_id"": ""4680232990957""," +
             """item_id"": ""cbf9d985-4f82-11f1-8dad-000c297312bc""," +
             """name"": ""Ягодный взвар Иван Да с боярышником 96 г""," +
             """quantity"": 1,""price"": 1650}" +
             "]," +
             """total_items_price_without_discount"": 14084," +
             """total_discount_amount"": 0," +
             """delivery_price"": 0," +
             """final_amount"": 14084" +
             "}";
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	ДокОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДата();
    ДокОбъект.ВидЗаказа = mona_ОбработкаИнтернетЗаказа.ВидЗаказаИнтернет(?(ДанныеЗапроса.delivery_method = "pickup","ПВЗ","Интернет-заказ"));
	ДокОбъект.НоменклатураДоставки = Справочники.Номенклатура.НайтиПоНаименованию("Доставка");
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	ДокСсылка = ДокОбъект.Ссылка;
		ДокОбъект.СтавкаНДСДоставки = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			   ДокОбъект.СуммаНДСДоставки = 0;
                 ДокОбъект.СтоимостьДоставки = 400;
	НоваяЗапись = РегистрыСведений.ЗаказыОнлайн.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВидЗаказа = ДокСсылка.ВидЗаказа; 
	НоваяЗапись.Заказ = ДокСсылка; 
	НоваяЗапись.order_number = ДанныеЗапроса.order_number;
	НоваяЗапись.order_id 	= ДокСсылка.УникальныйИдентификатор(); 
	НоваяЗапись.КодJSON = Новый ХранилищеЗначения(СтрокаJSON,Новый СжатиеДанных(9)); 
	НоваяЗапись.Записать();
	СоздатьЗаказНаСервере(ДокСсылка);
	


КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказНаСервере(Заказ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ КодJSON ИЗ РегистрСведений.ЗаказыОнлайн ГДЕ Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда  
		ДанныеЗаказа = ПрочитатьJSONизХранилища(Выборка.КодJSON);
	КонецЕсли;
	Заказ = Заказ.ПолучитьОбъект(); 
	//	Заказ.Дата = ТекущаяДата();
	//  ТочкаОтгрузки = Справочники.mona_ТочкиОтгрузки.
	Заказ.ДатаОтгрузки = ТекущаяДата();
	Если ДанныеЗаказа.delivery_type = "pickup" Тогда  
		Заказ.ВидЗаказа = ВидЗаказаПВЗ(); 
		Заказ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	Иначе
		Заказ.ВидЗаказа = ВидЗаказаИнтернет(); 
		Заказ.СпособДоставки = Перечисления.СпособыДоставки.Курьер;
	КонецЕсли;
	
	ЗаполнитьПоТочкеОтгрузки(Заказ);
	Заказ.СостояниеЗаказа = mona_СтатусыЗаказов.Создан();
	Заказ.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	
	Попытка 
		
		СтрКонтрагент = НайтиИлиСоздатьКонтрагента(ДанныеЗаказа.recipient);
		Заказ.Контрагент = СтрКонтрагент.Контрагент;
		Заказ.Телефон = СтрКонтрагент.Телефон;
		Заказ.АдресЭП = СтрКонтрагент.Email; 
		ЗаполнениеОбъектовУНФ.ЗаполнитьДоговорПоУмолчанию(Заказ);
		Если ДанныеЗаказа.Свойство("delivery_address") Тогда
			Заказ.АдресДоставки = ДанныеЗаказа.delivery_address;
			Заказ.Комментарий = ДанныеЗаказа.delivery_comment;
			//Если ДанныеЗаказа.delivery_address.Свойство("coordinates") Тогда
			//	Заказ.Комментарий = Заказ.Комментарий +" "+ ДанныеЗаказа.delivery_address.coordinates;
			//	ТочкаДоставки = ДанныеЗаказа.delivery_address.coordinates;
			//	Заказ.mona_Долгота = ТочкаДоставки.longitude; 
			//	Заказ.mona_Широта = ТочкаДоставки.latitude; 
			//КонецЕсли;
		КонецЕсли;  
		Если Заказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда 
			СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.БезНДС);	
		КонецЕсли;  
		Заказ.СтатусСборки = 0;
		Заказ.Запасы.Очистить();
		Заказ.СерииНоменклатуры.Очистить();
		Если ДанныеЗаказа.Свойство("payment_method") Тогда
			Заказ.СпособЗачетаПредоплаты = Перечисления.СпособыЗачетаИРаспределенияПлатежей.Авто;
		КонецЕсли;     
		СуммаДокумента = 0;
		
		Если ДанныеЗаказа.Свойство("items") Тогда
			Для каждого ТоварJSON Из ДанныеЗаказа.items Цикл
				СтрокаТЧ = Заказ.Запасы.Добавить();
				
				
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварJSON.external_product_id));
				//Номенклатура = НайтиНоменклатуру(ТоварJSON.name);
				
				СтрокаТЧ.Номенклатура = Номенклатура;
				СтрокаТЧ.ТипНоменклатурыЗапас = Истина;
				СтрокаТЧ.Количество = ТоварJSON.quantity;
				СтрокаТЧ.КоличествоСобрано = 0;
				СтрокаТЧ.КоличествоСобрано = 0;
				СтрокаТЧ.Резерв = ТоварJSON.quantity;
				СтрокаТЧ.Цена = ТоварJSON.price;
				СтрокаТЧ.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
				СтрокаТЧ.КлючСвязи = СтрокаТЧ.НомерСтроки;
				СтрокаТЧ.Сумма = ТоварJSON.price * ТоварJSON.quantity;
				СтрокаТЧ.СтавкаНДС = СтавкаНДС;
				Если ТоварJSON.Свойство("discount") И ТоварJSON.discount > 0 Тогда
					СтрокаТЧ.СуммаСкидкиНаценки = ТоварJSON.discount;
				Иначе
					СтрокаТЧ.СуммаСкидкиНаценки = 0;
				КонецЕсли; 
				СтрокаТЧ.Всего = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаСкидкиНаценки;
				
				//Серии=НайтиСерииНоменклатуры(Номенклатура,ТоварJSON.quantity);
				
				//Для Каждого СерияИзМассива Из Серии Цикл
				//	СтрокаСерии = Заказ.СерииНоменклатуры.Добавить(); 
				//	СтрокаСерии.КлючСвязи = СтрокаТЧ.НомерСтроки;
				//	СтрокаСерии.Серия = СерияИзМассива.Серия;
				//	СтрокаСерии.Количество = СерияИзМассива.Количество; 
				//	СтрокаСерий = СтрокаТЧ.СерииНоменклатуры + СерияИзМассива.Серия + ",";
				//	СтрокаТЧ.СерииНоменклатуры = Сред(СтрокаСерий,2);
				//КонецЦикла;
				СтрокаТЧ.СтруктурнаяЕдиницаРезерв = Заказ.СтруктурнаяЕдиницаРезерв;
				
				СуммаДокумента = СуммаДокумента + СтрокаТЧ.Всего;	
			КонецЦикла;
		КонецЕсли;
		Если СуммаДокумента <> ДанныеЗаказа.total_price Тогда 
			Сообщить ("Сумма заказа не равна сумме строк");
		КонецЕсли;
		Заказ.СуммаДокумента = СуммаДокумента;
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		Заказ.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
КонецПроцедуры 

&НаСервере
Функция  ПолучитьТоварыИзJSON(Заказ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ КодJSON ИЗ РегистрСведений.ЗаказыОнлайн ГДЕ Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда  
		ДанныеЗаказа = ПрочитатьJSONизХранилища(Выборка.КодJSON);
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("СуммаСкидкиНаценки", Новый ОписаниеТипов("Число"));
		Если ДанныеЗаказа.Свойство("items") Тогда
			Для каждого ТоварJSON Из ДанныеЗаказа.items Цикл
				СтрокаТЧ = ТаблицаТоваров.Добавить();
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварJSON.external_product_id));
				СтрокаТЧ.Номенклатура = Номенклатура;
				СтрокаТЧ.Количество = ТоварJSON.quantity;
				СтрокаТЧ.Цена = ТоварJSON.price;
				СтрокаТЧ.Сумма = ТоварJSON.price * ТоварJSON.quantity;
				//Если ТоварJSON.Свойство("discount") И ТоварJSON.discount > 0 Тогда
				//	СтрокаТЧ.СуммаСкидкиНаценки = ТоварJSON.discount;
				//Иначе
				//	СтрокаТЧ.СуммаСкидкиНаценки = 0;
				//КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		Возврат ТаблицаТоваров;	
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция  ПроверкаКассовойСмены(КассаККМ,Организация,СтрСмены = Неопределено) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
	|	КассоваяСмена.НачалоКассовойСмены КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены,
	|	ДОБАВИТЬКДАТЕ(КассоваяСмена.НачалоКассовойСмены, ДЕНЬ, 1) КАК ДатаИстеченияСрокаДействия,
	|	КассоваяСмена.Организация КАК Организация,
	|	КассоваяСмена.Статус КАК Статус
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Организация = &Организация
	|	И КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.НачалоКассовойСмены УБЫВ");
	
	Запрос.УстановитьПараметр("ФискальноеУстройство", КассаККМ.ПодключаемоеОборудование);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
        Если Не СтрСмены = Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(СтрСмены,Выб);
		КонецЕсли;	
		Возврат (Выб.Статус = Перечисления.СтатусыКассовойСмены.Открыта);
	КонецЕсли;	
КонецФункции
&НаСервере
функция НоваяОперацияПоПлатежнымКартамНаСервере(ЗаписьЗаказОнлайн) Экспорт

	ДокОбъект = Документы.ОперацияПоПлатежнымКартам.СоздатьДокумент();
	ДокОбъект.ЗаполнитьПоЗаказПокупателя(ЗаписьЗаказОнлайн.Заказ);
	
	ДокОбъект.СпособОплаты = Перечисления.СпособыОплатыЭквайринг.ОплатаОнлайн;
	ДокОбъект.ЭквайринговыйТерминал = Справочники.СпособыОплаты.НайтиПоНаименованию("TipTop");
	ДокОбъект.НомерПлатежнойКарты = ЗаписьЗаказОнлайн.tiptoppay_id;
	
	
	
КонецФункции	
&НаСервере
функция СоздатьПервичныйЧекНаСервере(Заказ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Заказ КАК Заказ,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Заказ = &Заказ
	|	И ЧекККМ.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПервичныйЧек = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;      
	
	Если ПервичныйЧек = Неопределено тогда
		ЧекККМ = Документы.ЧекККМ.СоздатьДокумент();
		ЧекККМ.Дата= текущаядата();
		ЧекККМ.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		ЧекККМ.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		ЧекККМ.ЕстьЗаказы = Истина;
		ЧекККМ.ОперацияСДенежнымиСредствами = истина;	 
		Попытка
			ЧекККМ.Заполнить(Заказ);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		//ЧекККМ.ОперацияСДенежнымиСредствами = истина;	 
		
		ЧекККМ.СуммаДокумента =Заказ.СуммаДокумента ; 
		ЧекККМ.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Безналичные;
			СтрокаОплаты = ЧекККМ.БезналичнаяОплата.Добавить();
			СтрокаОплаты.Сумма = Заказ.СуммаДокумента;
			СтрокаОплаты.ВидОплаты = Перечисления.ВидыБезналичныхОплат.БанковскаяКарта;
		Попытка
			ЧекККМ.Записать(РежимЗаписиДокумента.Проведение);   
		Исключение
			Возврат Неопределено;
		КонецПопытки;   
		ПервичныйЧек = ЧекККМ.Ссылка;
		//    mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    Перечисления.mona_Статус.Успех,
		//    "",
		//    Заказ,
		//    1,
		//    Заказ.СуммаДокумента);
		//    Возврат ЧекККМ.Ссылка; 
		//Исключение
		//    mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    "",
		//    Заказ,
		//    Перечисления.mona_Статус.Ошибка,
		//    ОписаниеОшибки(),
		//    1);
		//КонецПопытки;
	Конецесли; 
	Возврат ПервичныйЧек;
КонецФункции 
&НаСервере
Функция mona_СозданиеЧеков(Заказ);
	//СоздатьПолныйВозвратЧекНаСервере(Заказ)
	//Если (Объект.СостояниеЗаказа.Наименование = "Ожидает оплаты")  и Объект.Запасы.Количество()= 0 тогда
	//	mona_ОбработкаИнтернетЗаказа.СоздатьЗаказНаСервере(Объект.Ссылка);
	//конецесли;
	//Если (Объект.СостояниеЗаказа.Наименование = "Отменён") тогда 
	//	Чек = mona_ОбработкаИнтернетЗаказа.СоздатьПолныйВозвратЧекНаСервере(Объект.Ссылка);
	//	возврат Чек;
	//конецесли;	
	//Если (Объект.СостояниеЗаказа.Наименование = "Отгружен") тогда 
		Чек = mona_ОбработкаИнтернетЗаказа.СоздатьРезультирующийЧекНаСервере(Заказ);
		
		возврат Чек;
	//конецесли;
	//Если (Объект.СостояниеЗаказа.Наименование = "Оплачен") тогда
	//	Чек = mona_ОбработкаИнтернетЗаказа.СоздатьПервичныйЧекНаСервере(Объект.Ссылка); 
	//	возврат Чек;
	//конецесли;
	
	//Если (Объект.СостояниеЗаказа.Наименование = "Отменён") тогда
	//	//mona_ОбработкаИнтернетЗаказа.СоздатьЧекНаВозвратНаСервере(Объект.Ссылка);		
	//конецесли; 
КонецФункции

&НаСервере
Функция СоздатьЧекНаВозвратНаСервере(Заказ,ПервичныйЧек=Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Заказ КАК Заказ,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Заказ = &Заказ
	|	И ЧекККМ.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПервичныйЧек = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМВозврат.Ссылка КАК Ссылка,
	|	ЧекККМВозврат.Заказ КАК Заказ
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуществуетЧекВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
	
	Попытка
		Если ПервичныйЧек <> Неопределено и СуществуетЧекВозврата = Неопределено тогда
			ЧекККМВозврат = Документы.ЧекККМВозврат.СоздатьДокумент();
			ЧекККМВозврат.Дата= текущаядата();
			ЧекККМВозврат.Заполнить(ПервичныйЧек);  
			ЧекККМВозврат.ЕстьЗаказы = Истина;
			
			ТЧПервичныйЧек = ПервичныйЧек.запасы;
			
			ТЧТекущийЗаказ = Заказ.Запасы; 
			
			ЧекККМВозврат.Заказ = ПервичныйЧек.Заказ;
			ЧекККМВозврат.Контрагент =Заказ.Контрагент;
			ЧекККМВозврат.ЧекККМ = ПервичныйЧек.Ссылка;
			ЧекККМВозврат.Договор = ПервичныйЧек.Договор; 
			ЧекККМВозврат.ОперацияСДенежнымиСредствами = истина;
			ЧекККМВозврат.СуммаДокумента = ПервичныйЧек.СуммаДокумента;
			ЧекККМВозврат.ДвиженияПоЗапасамУдалять = ПервичныйЧек.ДвиженияПоЗапасамУдалять;
			
			ТЧВозврата = ЧекККМВозврат.Запасы;  
			
			ТаблицаСравнения = Новый ТаблицаЗначений;
			ТаблицаСравнения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаСравнения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТаблицаСравнения.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
			ТаблицаСравнения.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
			ТаблицаСравнения.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
			
			Для каждого СтрокаЧека Из ТЧПервичныйЧек Цикл
				НоваяСтрока = ТаблицаСравнения.Добавить();
				НоваяСтрока.Номенклатура = СтрокаЧека.Номенклатура;
				НоваяСтрока.Количество = СтрокаЧека.Количество;
				НоваяСтрока.СтавкаНДС = СтрокаЧека.СтавкаНДС;
				НоваяСтрока.СуммаНДС = СтрокаЧека.СуммаНДС;
				НоваяСтрока.Цена = СтрокаЧека.Цена;
			КонецЦикла;
			
			Для каждого СтрокаЗаказа Из ТЧТекущийЗаказ Цикл
				НоваяСтрока = ТаблицаСравнения.Добавить();
				НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
				НоваяСтрока.Количество = -СтрокаЗаказа.Количество;
				НоваяСтрока.СтавкаНДС = СтрокаЗаказа.СтавкаНДС;
				НоваяСтрока.СуммаНДС = -СтрокаЗаказа.СуммаНДС;
				НоваяСтрока.Цена = 0;
			КонецЦикла;
			
			ТаблицаСравнения.Свернуть("Номенклатура,СтавкаНДС", "Количество,Цена,СуммаНДС");
			
			ТЧВозврата.Очистить();
			СуммаДокумента = 0;
			Для каждого СтрокаИтог Из ТаблицаСравнения Цикл
				Если СтрокаИтог.Количество > 0 Тогда
					НоваяСтрокаВозврата = ТЧВозврата.Добавить();
					НоваяСтрокаВозврата.Номенклатура = СтрокаИтог.Номенклатура;
					НоваяСтрокаВозврата.Количество = СтрокаИтог.Количество;
					
					СтрокаЧека = ТЧПервичныйЧек.Найти(СтрокаИтог.Номенклатура, "Номенклатура");
					Если СтрокаЧека <> Неопределено Тогда
						НоваяСтрокаВозврата.Цена = СтрокаЧека.Цена;
						НоваяСтрокаВозврата.Сумма = СтрокаИтог.Количество * СтрокаЧека.Цена;
						НоваяСтрокаВозврата.Цена = СтрокаИтог.Цена;
						НоваяСтрокаВозврата.СтавкаНДС = СтрокаИтог.СтавкаНДС;
						НоваяСтрокаВозврата.СуммаНДС = СтрокаИтог.СуммаНДС;
						НоваяСтрокаВозврата.Сумма = Окр((СтрокаИтог.Количество * СтрокаИтог.Цена),0,1);
						НоваяСтрокаВозврата.Всего = НоваяСтрокаВозврата.Сумма;
						СуммаДокумента = СуммаДокумента + НоваяСтрокаВозврата.Сумма;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ЧекККМВозврат.СуммаДокумента = СуммаДокумента; 
			ВыгруженныеДанные = ПервичныйЧек["БезналичнаяОплата"].Выгрузить();
			ЧекККМВозврат["БезналичнаяОплата"].Загрузить(ВыгруженныеДанные);
			для каждого стр из ЧекККМВозврат.БезналичнаяОплата цикл
				стр.Сумма = СуммаДокумента;
			конеццикла;   
			
			Если ЧекККМВозврат.Запасы.Количество() >0 тогда
				ЧекККМВозврат.Записать(РежимЗаписиДокумента.Проведение);
				ВернутьЧЕК= ЧекККМВозврат.Ссылка;
				//   	 Попытка
				//   		 mona_ЖурналОбмена.ЗаписатьСобытие(
				//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
				//    Перечисления.mona_НаправлениеОбмена.Исходящее,
				//    Перечисления.mona_Источник.Система,
				//    Перечисления.mona_Источник.Webkassa,
				//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
				//    Перечисления.mona_Статус.Успех,
				//    "",
				//    Заказ,
				//    1,
				//    Заказ.СуммаДокумента);
				//Исключение       
				//    mona_ЖурналОбмена.ЗаписатьСобытие(
				//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
				//    Перечисления.mona_НаправлениеОбмена.Исходящее,
				//    Перечисления.mona_Источник.Система,
				//    Перечисления.mona_Источник.Webkassa,
				//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
				//    "",
				//    Заказ,
				//    Перечисления.mona_Статус.Ошибка,
				//    ОписаниеОшибки(),
				//    1);
				//    КонецПопытки;
			Конецесли; 
		Конецесли;
		
	Исключение 
		ВернутьЧЕК = неопределено;
	конецпопытки;
	Возврат ВернутьЧЕК ;
КонецФункции 

&НаСервере
функция СоздатьРезультирующийЧекНаСервере(Заказ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Заказ КАК Заказ,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Заказ = &Заказ
	|	И ЧекККМ.Проведен = ИСТИНА
	|	И ЧекККМ.ОперацияСДенежнымиСредствами = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультирующийЧек = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Если РезультирующийЧек = Неопределено тогда
		ЧекККМ = Документы.ЧекККМ.СоздатьДокумент();
		ЧекККМ.Дата= текущаядата();
		ЧекККМ.ОперацияСДенежнымиСредствами = Ложь;	
		Попытка
			ЧекККМ.Заполнить(Заказ);
			ЧекККМ.ЕстьЗаказы = Истина;
			ЧекККМ.СуммаДокумента =Заказ.СуммаДокумента ; 
			ЧекККМ.ФормаОплаты=Перечисления.ТипыДенежныхСредств.Безналичные; 
			ЧекККМ.ТелефонАдресЭП = "АдресЭП";
			
			СтрокаОплаты = ЧекККМ.БезналичнаяОплата.Добавить();
			СтрокаОплаты.Сумма = Заказ.СуммаДокумента;
			СтрокаОплаты.ЭквайринговыйТерминал    = ЧекККМ.ЭквайринговыйТерминал; 
			СтрокаОплаты.ВидОплаты = Перечисления.ВидыБезналичныхОплат.БанковскаяКарта;
			
			ЧекККМ.Записать(РежимЗаписиДокумента.Проведение);   
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		РезультирующийЧек = ЧекККМ.Ссылка; 
		//    Попытка  
		//   mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    Перечисления.mona_Статус.Успех,
		//    "",
		//    Заказ,
		//    1,
		//    Заказ.СуммаДокумента);
		//Исключение
		//    mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    "",
		//    Заказ,
		//    Перечисления.mona_Статус.Ошибка,
		//    ОписаниеОшибки(),
		//    1);
		//    КонецПопытки;
	Конецесли;
	Возврат РезультирующийЧек;
	
КонецФункции

&НаСервере
функция СоздатьПолныйВозвратЧекНаСервере(Заказ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Заказ КАК Заказ,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Заказ = &Заказ
	|	И ЧекККМ.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПервичныйЧек = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Если ПервичныйЧек <> Неопределено тогда
		ЧекККМ = Документы.ЧекККМВозврат.СоздатьДокумент();
		ЧекККМ.Дата= текущаядата();
		ЧекККМ.ОперацияСДенежнымиСредствами = Истина;	 
		ЧекККМ.ЗаполнитьПоЧекуККМ(ПервичныйЧек);
		//ЧекККМ.ЕстьЗаказы = Истина;   
		//   
		//ЧекККМ.Контрагент =Заказ.Контрагент;
		//ЧекККМ.ЧекККМ = ПервичныйЧек.Ссылка;
		//ЧекККМ.Договор = ПервичныйЧек.Договор; 
		//ЧекККМ.ОперацияСДенежнымиСредствами = истина;
		//ЧекККМ.СуммаДокумента = ПервичныйЧек.СуммаДокумента;
		//ЧекККМВозврат.ДвиженияПоЗапасамУдалять = ПервичныйЧек.ДвиженияПоЗапасамУдалять;
		
		
		//ЧекККМ.СуммаДокумента = Заказ.СуммаДокумента ; 
		// ВыгруженныеДанные = ПервичныйЧек["БезналичнаяОплата"].Выгрузить();
		// ЧекККМ["БезналичнаяОплата"].Загрузить(ВыгруженныеДанные);
		// для каждого стр из ЧекККМ.БезналичнаяОплата цикл
		//	 стр.Сумма = ПервичныйЧек.СуммаДокумента;
		// конеццикла;
		ЧекККМ.Записать(РежимЗаписиДокумента.Проведение);   
		// Исключение
		// 	Возврат Неопределено;
		//КонецПопытки;
		РезультирующийЧек = ЧекККМ.Ссылка; 
		//    Попытка  
		//   mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    Перечисления.mona_Статус.Успех,
		//    "",
		//    Заказ,
		//    1,
		//    Заказ.СуммаДокумента);
		//Исключение
		//    mona_ЖурналОбмена.ЗаписатьСобытие(
		//    Перечисления.mona_ТипСобытийОбмена.ФискальныйЧекПродажи,
		//    Перечисления.mona_НаправлениеОбмена.Исходящее,
		//    Перечисления.mona_Источник.Система,
		//    Перечисления.mona_Источник.Webkassa,
		//    Перечисления.mona_Инициатор.АвтоматическийПроцесс,
		//    "",
		//    Заказ,
		//    Перечисления.mona_Статус.Ошибка,
		//    ОписаниеОшибки(),
		//    1);
		//    КонецПопытки;
	Конецесли;
	Возврат РезультирующийЧек;
	
КонецФункции

&НаСервере
Процедура ФормированиеВозврата(Заказ) Экспорт
		 ПервичныеДанныеЗаказа = mona_ОбработкаИнтернетЗаказа.ПолучитьТоварыИзJSON(Заказ);
        	 
    	 ТЧПервичныйЧек = ПервичныеДанныеЗаказа;
    	 
    	 ТЧТекущийЗаказ = Заказ.Запасы;  
		 
    	 ТаблицаСравнения = Новый ТаблицаЗначений;
    	 ТаблицаСравнения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
    	 ТаблицаСравнения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
    	 ТаблицаСравнения.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
    	 ТаблицаСравнения.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
    	 
    	 Для каждого СтрокаЧека Из ТЧПервичныйЧек Цикл
    		 НоваяСтрока = ТаблицаСравнения.Добавить();
    		 НоваяСтрока.Номенклатура = СтрокаЧека.Номенклатура;
    		 НоваяСтрока.Количество = СтрокаЧека.Количество; 
    		 НоваяСтрока.СуммаНДС = СтрокаЧека.СуммаНДС;
    		 НоваяСтрока.Цена = СтрокаЧека.Цена;
    	 КонецЦикла;
    	 
    	 Для каждого СтрокаЗаказа Из ТЧТекущийЗаказ Цикл
    		 НоваяСтрока = ТаблицаСравнения.Добавить();
    		 НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
    		 НоваяСтрока.Количество = -СтрокаЗаказа.Количество;
    		 НоваяСтрока.СуммаНДС = -СтрокаЗаказа.СуммаНДС;
    		 НоваяСтрока.Цена = 0;
    	 КонецЦикла;
    	 
    	 ТаблицаСравнения.Свернуть("Номенклатура", "Количество,Цена,СуммаНДС");
    	 
       	СуммаВозврата = 0; 
		МенеджерЗаписи = РегистрыСведений.mona_Возвраты.СоздатьМенеджерЗаписи(); 
		
		ТипВозврата = "";
		
		Запрос = Новый Запрос;
	 		Запрос.Текст = "ВЫБРАТЬ
	                |	ЗаказыОнлайн.ПричинаОтмены КАК ПричинаОтмены,
	                |	ЗаказыОнлайн.ПризнакОтложенногоВозврата КАК ПризнакОтложенногоВозврата,
	                |	ЗаказыОнлайн.tiptoppay_id КАК tiptoppay_id
	                |ИЗ
	                |	РегистрСведений.ЗаказыОнлайн КАК ЗаказыОнлайн
	                |ГДЕ
	                |	ЗаказыОнлайн.Заказ = &Заказ";  
	 		Запрос.УстановитьПараметр("Заказ", Заказ); 
	 		
	 		для каждого стр из Заказ.ОтмененныеЗапасы цикл
	 		     ТипВозврата = ТипВозврата +стр.mona_ТипВозврата.Наименование+"; "; 
	 		конеццикла;
	 		МенеджерЗаписи.ТипВозврата   =  ТипВозврата; 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 	МенеджерЗаписи.ПризнакОтложенногоВозврата		   =  Выборка.ПризнакОтложенногоВозврата; 
		 	МенеджерЗаписи.tiptoppay_id   		   =  Выборка.tiptoppay_id;
	 КонецЕсли;
	 
		   Для каждого стр из ТаблицаСравнения цикл
		    СуммаВозврата = СуммаВозврата+(стр.Цена*стр.Количество);   
		   конеццикла;
		  	МенеджерЗаписи.Заказ = Заказ; 
			МенеджерЗаписи.СоставВозвратаJSON = ТаблицаСравнения;
			МенеджерЗаписи.СуммаВозврата = СуммаВозврата; 
			МенеджерЗаписи.Записать(Ложь);
	КонецПроцедуры


&НаСервере
Процедура ЧекКФискализации(СсылкаЗаказа,Чек = Неопределено) Экспорт
	МенеджерЧтения = РегистрыСведений.ЗаказыОнлайн.СоздатьМенеджерЗаписи();
	МенеджерЧтения.Заказ = СсылкаЗаказа;
	МенеджерЧтения.Прочитать();     
	МенеджерЧтения.ПробитьЧек = Истина;     
	МенеджерЧтения.Записать();
КонецПроцедуры

&НаСервере	
Функция НайтиСерииНоменклатуры(Номенклатура,Количество);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатурыОстатки.Серия КАК Серия,
	|	СерииНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СерииНоменклатурыОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.СерииНоменклатуры.Остатки КАК СерииНоменклатурыОстатки
	|ГДЕ
	|	СерииНоменклатурыОстатки.Серия.Продан = &Ложь
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерииНоменклатурыОстатки.Серия.ГоденДо";
	
	
	запрос.УстановитьПараметр("Ложь",ложь);
	Результат = Запрос.Выполнить().Выбрать();
	
	НужноеКоличество = Количество;
	НабранныеСерии = Новый Массив;
	
	Пока Результат.Следующий() И НужноеКоличество > 0 Цикл
		КоличествоВСерии = Результат.КоличествоОстаток;
		Если КоличествоВСерии >= НужноеКоличество Тогда
			СтруктураСерии = Новый Структура("Серия, Количество", Результат.Серия, НужноеКоличество);
			НабранныеСерии.Добавить(СтруктураСерии);
			НужноеКоличество = 0;
		Иначе
			СтруктураСерии = Новый Структура("Серия, Количество", Результат.Серия, КоличествоВСерии);
			НабранныеСерии.Добавить(СтруктураСерии);
			НужноеКоличество = НужноеКоличество - КоличествоВСерии;
		КонецЕсли;
	КонецЦикла;
	
	Если НужноеКоличество > 0 Тогда
		Сообщить("НехватилоСерии!"); 
	КонецЕсли;
	Возврат НабранныеСерии;
конецфункции

&НаСервере
Функция НайтиИлиСоздатьКонтрагента(ДанныеКонтрагента)
	
	Результат = Новый Структура("Контрагент,Телефон,Email,ФИО");
	Результат.Телефон = ДанныеКонтрагента.phone;
	Результат.Email = ДанныеКонтрагента.email;
	Результат.ФИО = ДанныеКонтрагента.last_name + "" +ДанныеКонтрагента.first_name;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка 
	|ИЗ
	|	Справочник.Контрагенты 
	|ГДЕ " + ?(ПустаяСтрока(Результат.Телефон),
				?(ПустаяСтрока(Результат.Email),
					"Наименование = &Наименование","АдресЭПДляПоиска = &Email"),
				"НомерТелефонаДляПоиска = &Телефон");
				
				
	Если ПустаяСтрока(Результат.Телефон) Тогда
		Если ПустаяСтрока(Результат.Email) Тогда 
			Запрос.УстановитьПараметр("Наименование", Результат.ФИО);
		Иначе	
			Запрос.УстановитьПараметр("Email", Результат.Email);
		КонецЕсли;
	Иначе 
		Запрос.УстановитьПараметр("Телефон", Результат.Телефон);
	КонецЕсли;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Контрагент = Выборка.Ссылка;
	Иначе
		Результат.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("РозничныйПокупатель");
		//    Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//
		//    Контрагент.ВидКонтрагента=Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		//    Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		//    Контрагент.Наименование = ФИО;
		//    Контрагент.НаименованиеПолное = ФИО;
		//    Контрагент.Покупатель = истина;		
		//Попытка
		//    Контрагент.Записать();
		//    Результат.Контрагент = Контрагент.Ссылка;
		//Исключение
		//    Возврат Неопределено;
		//КонецПопытки;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция СоздатьДоговорКонтрагента(Контрагент)
	
	Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Договор.Наименование = "Основной договор";
	Договор.Контрагент = Контрагент.Ссылка;
	Договор.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	Договор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("KZT");
	Договор.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("KZT");
	Договор.ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("KZT");
	Договор.Записать();
	
	Возврат Договор.Ссылка;
	
КонецФункции

&НаСервере
Функция ТипВозвратаНайтиПоНаименованию(Имя)Экспорт  
	Причина = Справочники.mona_ТипыВозврата.НайтиПоНаименованию(Имя);
	Возврат Причина;
конецФункции

&НаСервере
Функция НайтиНоменклатуру(Название)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Название
	|";
	
	Запрос.УстановитьПараметр("Название", Название);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
// wein }

// {
//  "order_number": 1024,
//  "created_at": "2026-07-06T14:30:15+03:00",
//  "recipient": {
//    "full_name": "Иванов Иван Иванович",
//    "phone": "+77791234567",
//    "email": "ivanov@example.com"
//  },
//  "delivery_method": "delivery",
//  "delivery_address": {
//    "address": "г. Астана, ул. Главная, д. 10, кв. 45",
//    "coordinates": {
//      "latitude": 55.755826,
//      "longitude": 37.617299
//    },
//    "courier_comment": "Код домофона 45к123, этаж 5, лифт работает. Пожалуйста, позвоните за 15 минут до приезда."
//  },
//  "time_slot": "18:00-20:00",
//  "payment_method": "card_online",
//  "tiptoppay_session_id": "session_live_a1b2c3d4e5f6g7h8i9j0",
//  "items": [
//    {
//      "item_id": "sku-99402",
//      "name": "Сухари сушеные",
//      "quantity": 1,
//      "price_with_discount": 4500.00
//    },
//    {
//      "item_id": "sku-11205",
//      "name": "Яблочный джем",
//      "quantity": 2,
//      "price_with_discount": 750.00
//    }
//  ],
//  "total_items_price_without_discount": 6700.00,
//  "total_discount_amount": 700.00,
//  "delivery_price": 350.00,
//  "final_amount": 6350.00
//}

&НаСервере
Функция ЕстьЧекВозврат(Заказ) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМВозврат.Ссылка КАК Ссылка,
	|	ЧекККМВозврат.Заказ КАК Заказ
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Заказ = &Заказ
	|	И ЧекККМВозврат.Проведен = &Проведен";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Проведен", Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат Истина;
	иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьЗаписьВозврата(Заказ) экспорт
	Запись = РегистрыСведений.mona_Возвраты.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда 
		Возврат Запись;	
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверкаВеса(Заказ)Экспорт 
	Точность =  Константы["mona_ТочностьОбщая"].Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Заказ КАК Заказ,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Заказ = &Заказ
	|	И ЧекККМ.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПервичныйЧек = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Попытка  
		ТЧПервичныйЧек = ПервичныйЧек.запасы;
		
		ТЧТекущийЗаказ = Заказ.Запасы; 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПервичныйЧек = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		ТаблицаСравнения = Новый ТаблицаЗначений;
		ТаблицаСравнения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаСравнения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		Для каждого СтрокаЧека Из ТЧПервичныйЧек Цикл
			НоваяСтрока = ТаблицаСравнения.Добавить();
			НоваяСтрока.Номенклатура = СтрокаЧека.Номенклатура;
			НоваяСтрока.Количество = СтрокаЧека.Количество;
		КонецЦикла;
		
		Для каждого СтрокаЗаказа Из ТЧТекущийЗаказ Цикл
			НоваяСтрока = ТаблицаСравнения.Добавить();
			НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
			НоваяСтрока.Количество = -СтрокаЗаказа.КоличествоСобрано;
		КонецЦикла;
		
		ТаблицаСравнения.Свернуть("Номенклатура", "Количество");
		Результат = новый структура;
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		ТаблицаТоваров.Колонки.Добавить("Количество");
		ПустаяСтуктура =  новый структура;
		
		Для каждого стр из ТаблицаСравнения цикл
			Если стр.Количество < 0 тогда
				Отбор = Новый Структура("Номенклатура", стр.Номенклатура);
				//Точность = стр.Номенклатура.mona_Точность/100;
				СтрПЧ = ТЧПервичныйЧек.НайтиСтроки(Отбор); 
				Если СтрПЧ.Количество() = 0 Тогда
					Сообщить("Отсутствует в чеке: "+стр.Номенклатура); 
					Продолжить;
				КонецЕсли;	 
				Если -стр.Количество > СтрПЧ[0].Количество*Точность/100 тогда
					Результат.Вставить("Действие","Блокировка")  ;
					Результат.Вставить("Номенклатура",стр.Номенклатура) ;			 
					Возврат Результат
				иначе
					Результат.Вставить("Действие","Списание");
					НоваяСтрока = ТаблицаТоваров.Добавить();
					НоваяСтрока.Номенклатура = стр.Номенклатура;
					НоваяСтрока.Количество = стр.Количество;
							Возврат Неопределено;
					конецесли;     
			конецесли;
		конеццикла;
		Результат.Вставить("Товары", ТаблицаТоваров);
		СоздатьСписание(Результат,Заказ) ;
	исключение
	конецпопытки;
конецфункции 

 &НаСервере
Функция ПроверкаВесаБезЧеков(Заказ,Отказ = Ложь)Экспорт 
	 Точность =  Константы["mona_ТочностьОбщая"].Получить();
	  
		 ТЧПервичныйЧек = ПолучитьТоварыИзJSON(Заказ);
		 
		 ТЧТекущийЗаказ = Заказ.Запасы; 
				 
		 ТаблицаСравнения = Новый ТаблицаЗначений;
		 ТаблицаСравнения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		 ТаблицаСравнения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		 
		 Для каждого СтрокаЧека Из ТЧПервичныйЧек Цикл
			 НоваяСтрока = ТаблицаСравнения.Добавить();
			 НоваяСтрока.Номенклатура = СтрокаЧека.Номенклатура;
			 НоваяСтрока.Количество = СтрокаЧека.Количество;
		 КонецЦикла;
		 
		 Для каждого СтрокаЗаказа Из ТЧТекущийЗаказ Цикл
			 НоваяСтрока = ТаблицаСравнения.Добавить();
			 НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
			 НоваяСтрока.Количество = -СтрокаЗаказа.КоличествоСобрано;
		 КонецЦикла;
		 
		 ТаблицаСравнения.Свернуть("Номенклатура", "Количество");
		 Результат = новый структура;
		 ТаблицаТоваров = Новый ТаблицаЗначений;
		 ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		 ТаблицаТоваров.Колонки.Добавить("Количество");
		 ПустаяСтуктура =  новый структура;
		 
		 Для каждого стр из ТаблицаСравнения цикл
			 Если стр.Количество < 0 тогда
				 Отбор = Новый Структура("Номенклатура", стр.Номенклатура);
				 //Точность = стр.Номенклатура.mona_Точность/100;
				 СтрПЧ = ТЧПервичныйЧек.НайтиСтроки(Отбор); 
				 Если СтрПЧ.Количество() = 0 Тогда
                 	Сообщить("Отсутствует в чеке: "+стр.Номенклатура); 
					Продолжить;
				 КонецЕсли;	 
				 Если -стр.Количество > СтрПЧ[0].Количество*(Точность/100) тогда
					 Результат.Вставить("Действие","Блокировка")  ;
					 Результат.Вставить("Номенклатура",стр.Номенклатура) ;			 
					 Возврат Результат
				 иначе
					 Результат.Вставить("Действие","Списание");
						 НоваяСтрока = ТаблицаТоваров.Добавить();
					 	 НоваяСтрока.Номенклатура = стр.Номенклатура;
					 	 НоваяСтрока.Количество = стр.Количество;
					 
				 конецесли;
			 конецесли;
		 конеццикла;
		 Результат.Вставить("Товары", ТаблицаТоваров); 
		 Если ТаблицаТоваров.Количество() > 0  тогда
			 СоздатьСписание(Результат,Заказ) ;
		 КонецЕсли;
 	     Возврат Неопределено;
конецфункции  

&НаСервере
Процедура СоздатьСписание(Структура,Заказ) Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасов.ДокументОснование КАК ДокументОснование,
		|	ПеремещениеЗапасов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.ДокументОснование = &Заказ
		|	И ПеремещениеЗапасов.Проведен = &ИСТИНА";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ИСТИНА", ИСТИНА);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		
		СозданоСписание = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
      Если СозданоСписание = Неопределено тогда
	Списание= Документы.ПеремещениеЗапасов.СоздатьДокумент();
	Списание.ЗаполнитьПоЗаказуПокупателя(Заказ);
	Списание.СтруктурнаяЕдиница =  заказ.СтруктурнаяЕдиницаРезерв;
	Списание.ХозяйственнаяОперация=Справочники.ХозяйственныеОперации.СписаниеНаРасходы;
	Списание.Дата = ТекущаяДата();
	Списание.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы;
	
	Списание.СчетЗатрат = ПланыСчетов.Управленческий.РасходыПоРеализацииПродукцииИОказаниюУслуг;
	Списание.Запасы.Очистить(); 
	
	Для каждого Стр из Структура.Товары цикл
		СтрЗапасы = Списание.Запасы.Добавить();
		СтрЗапасы.Номенклатура = Стр.Номенклатура;
		СтрЗапасы.Количество = -Стр.Количество;
		СтрЗапасы.ЗаказПокупателя = заказ;
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ВидОперации", Заказ.ВидОперации);
		СтруктураДанные.Вставить("Организация", Заказ.Организация);
		СтруктураДанные.Вставить("Номенклатура", СтрЗапасы.Номенклатура);
		
		СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Заказ, СтруктураДанные);
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
		СтрЗапасы.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		СтрЗапасы.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
		СтрЗапасы.НомерГТД = Неопределено;
		СтрЗапасы.Вес = СтруктураДанные.ВесЕдиницыТовара * СтрЗапасы.Количество;
		СтрЗапасы.Объем = СтруктураДанные.ОбъемЕдиницыТовара *СтрЗапасы.Количество;

		
	конеццикла;
	
	Списание.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ЕдиницаИзмерения");
	Реквизиты.Добавить("СтранаПроисхождения");
	Реквизиты.Добавить("СчетУчетаЗатрат");
	Реквизиты.Добавить("ЭтоНабор");
	Реквизиты.Добавить("ИспользоватьХарактеристики");
	Реквизиты.Добавить("ПроверятьЗаполнениеХарактеристики");
	Реквизиты.Добавить("ИспользоватьПартии");
	Реквизиты.Добавить("ПроверятьЗаполнениеПартий");
	Реквизиты.Добавить("ИспользоватьСерииНоменклатуры");
	Реквизиты.Добавить("ПрослеживаемыйТовар");
	Реквизиты.Добавить("ПрослеживаемыйКомплект");
	Реквизиты.Добавить("ТипНоменклатуры");
	Реквизиты.Добавить("Вес");
	Реквизиты.Добавить("Объем");
	Реквизиты.Добавить("ЗапретитьВводДробногоКоличества");
	ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура, Реквизиты);
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", ЗначенияРеквизитовНоменклатуры.СтранаПроисхождения);
	ТипСчетаЗатрат = Перечисления.ТипыСчетов.ПустаяСсылка();
	Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.СчетУчетаЗатрат) Тогда
		ТипСчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитовНоменклатуры.СчетУчетаЗатрат,
		"ТипСчета");
	КонецЕсли;

	СтруктураДанные.Вставить("ТипСчетаЗатрат", ТипСчетаЗатрат);
	СтруктураДанные.Вставить("НомерГТД", Неопределено);
	
	// Наборы
	СтруктураДанные.Вставить("ЭтоНабор", ЗначенияРеквизитовНоменклатуры.ЭтоНабор);
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) Тогда
		СтруктураДанные.ИспользоватьХарактеристики = ЗначенияРеквизитовНоменклатуры.ИспользоватьХарактеристики;
		СтруктураДанные.ПроверятьЗаполнениеХарактеристики = ЗначенияРеквизитовНоменклатуры.ПроверятьЗаполнениеХарактеристики;
	КонецЕсли;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(
			СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если Не СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли; 
	// Конец Характеристики
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий", Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) Тогда
		СтруктураДанные.ИспользоватьПартии = ЗначенияРеквизитовНоменклатуры.ИспользоватьПартии;
		СтруктураДанные.ПроверятьЗаполнениеПартий = ЗначенияРеквизитовНоменклатуры.ПроверятьЗаполнениеПартий;
	КонецЕсли;
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если СтруктураДанные.ИспользоватьПартии Тогда
		
		Если СтруктураДанные.Свойство("СтатусПартии")
			Тогда
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(
				СтруктураДанные.Номенклатура, СтруктураДанные.СтатусПартии);
		Иначе
			Если Не СтруктураДанные.Свойство("ВидОперации")
				Тогда
				ВидОперации = Неопределено
			Иначе
				ВидОперации = СтруктураДанные.ВидОперации
			КонецЕсли;
			
			СтатусПартии = НоменклатураВДокументахСервер.СоответствиеВидаОперацииИлиХозОперацииСтатусуПартии( ,
				ВидОперации);
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(
				СтруктураДанные.Номенклатура, СтатусПартии);
		КонецЕсли;
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия, ПартияПоУмолчанию);
		
	КонецЕсли;
	// Конец Партии
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура)
		И ЗначенияРеквизитовНоменклатуры.ИспользоватьСерииНоменклатуры Тогда
		
		СтатусПодбораСерий = СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные);
		
		Если СтатусПодбораСерий = 0 И СтруктураДанные.Свойство("ПараметрыПодбораСтатуса") Тогда
			СтруктураДанные.ПараметрыПодбораСтатуса.СтруктурнаяЕдиница = СтруктураДанные.ПараметрыПодбораСтатуса.СтруктурнаяЕдиницаПолучатель;
			СтатусПодбораСерий = СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные);
		КонецЕсли;
		
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", СтатусПодбораСерий);
		
	Иначе
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", 0);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы
		ИЛИ СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
		
		ГрузовыеТаможенныеДекларацииСервер.АвтоматическийПодборВРеализацииНомераГТД(СтруктураДанные);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("ТипНоменклатуры", ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры);
	
	// Прослеживаемость
	ЭтоПрослеживаемыйТовар = Ложь;
	Если ТипЗнч(ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйТовар) = Тип("Булево") Тогда
		ЭтоПрослеживаемыйТовар = ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйТовар;
	КонецЕсли;
	СтруктураДанные.Вставить("ПрослеживаемыйТовар", ЭтоПрослеживаемыйТовар
		И ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	ЭтоПрослеживаемыйКомплект = Ложь;
	Если ТипЗнч(ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйКомплект) = Тип("Булево") Тогда
		ЭтоПрослеживаемыйКомплект = ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйКомплект;
	КонецЕсли;
	СтруктураДанные.Вставить("ПрослеживаемыйКомплект", ЭтоПрослеживаемыйКомплект
		И ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	Если СтруктураДанные.ПрослеживаемыйТовар 
		И ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров") Тогда
		СтруктураДанные.Вставить("НомерГТД", Неопределено);
	КонецЕсли; 
	// Конец Прослеживаемость

	СтруктураДанные.Вставить("ВесЕдиницыТовара", ЗначенияРеквизитовНоменклатуры.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", ЗначенияРеквизитовНоменклатуры.Объем);
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества",
		ЗначенияРеквизитовНоменклатуры.ЗапретитьВводДробногоКоличества);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗаказИзРегистраФоновое(Параметры) Экспорт
	СоздатьЗаказНаСервере(Параметры[0]);
КонецПроцедуры
&НаСервере
Процедура ЗаписатьФормуЗаказаВРегистр(Форма) Экспорт
	
	МенеджерЧтения = РегистрыСведений.ЗаказыОнлайн.СоздатьМенеджерЗаписи();
	МенеджерЧтения.Заказ = Форма.Объект.Ссылка;
	МенеджерЧтения.Прочитать();                                                       
	
	Если НЕ МенеджерЧтения.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЧтения.ХолоднаяЧастьСобрана              = Форма["ХолоднаяЧастьСобрана"];     
	МенеджерЧтения.ОтменаДоОтгрузки              	 = Форма["ОтменаДоОтгрузки"];
	МенеджерЧтения.СухаяЧастьСобрана                 = Форма["СухаяЧастьСобрана"];
	МенеджерЧтения.МоментОтмены                      = Форма["МоментОтмены"];
	МенеджерЧтения.ПричинаОтмены                     = Форма["ПричинаОтмены"];
	МенеджерЧтения.ПризнакОтложенногоВозврата 	     = Форма["ПризнакОтложенногоВозврата"];
	МенеджерЧтения.ПризнакЧастичнойСборки            = Форма["ПризнакЧастичнойСборки"]; 
	МенеджерЧтения.ДатаОкончанияПриема               = Форма["ДатаОкончанияПриема"];
	МенеджерЧтения.ЗаказОтменен                      = Форма["ЗаказОтменен"];    
	
	ВСборке = (Форма.Объект.СостояниеЗаказа = mona_СтатусыЗаказов.ВСборке());
	Если ВСборке И Форма["ПризнакЧастичнойСборки"] Тогда
		Если ЗначениеЗаполнено(Форма["ВремяУстановкиЧастичнойСборки"]) Тогда
			МенеджерЧтения.ВремяУстановкиЧастичнойСборки = Форма["ВремяУстановкиЧастичнойСборки"];
		Иначе
			МенеджерЧтения.ВремяУстановкиЧастичнойСборки = ТекущаяДата();
		КонецЕсли;                                                                                           
	Иначе
		МенеджерЧтения.ВремяУстановкиЧастичнойСборки ='00010101';
	КонецЕсли;
	
	МенеджерЧтения.Записать();
КонецПроцедуры
&НаСервере
функция ЗаполнитьФормуЗаказаИзРегистра(Форма) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыОнлайн.ХолоднаяЧастьСобрана КАК ХолоднаяЧастьСобрана,
	               |	ЗаказыОнлайн.СухаяЧастьСобрана КАК СухаяЧастьСобрана,
	               |	ЗаказыОнлайн.ИсточникЗаказа КАК ИсточникЗаказа,
	               |	ЗаказыОнлайн.МоментОтмены КАК МоментОтмены,
	               |	ЗаказыОнлайн.НачалоВременногоИнтервалаДоставки КАК НачалоВременногоИнтервалаДоставки,
	               |	ЗаказыОнлайн.ПричинаОтмены КАК ПричинаОтмены,
	               |	ЗаказыОнлайн.ПризнакОтложенногоВозврата КАК ПризнакОтложенногоВозврата,
	               |	ЗаказыОнлайн.ПризнакЧастичнойСборки КАК ПризнакЧастичнойСборки,
	               |	ЗаказыОнлайн.ДатаОкончанияПриема КАК ДатаОкончанияПриема,
	               |	ЗаказыОнлайн.ВремяУстановкиЧастичнойСборки КАК ВремяУстановкиЧастичнойСборки,
	               |	ЗаказыОнлайн.ОтменаДоОтгрузки КАК ОтменаДоОтгрузки,
	               |	ЗаказыОнлайн.ЗаказОтменен КАК ЗаказОтменен,
	               |	ЗаказыОнлайн.ДатаРешенияОператора КАК ДатаРешенияОператора,
	               |	ЗаказыОнлайн.РешениеОператораПринято КАК РешениеОператораПринято
	               |ИЗ
	               |	РегистрСведений.ЗаказыОнлайн КАК ЗаказыОнлайн
	               |ГДЕ
	               |	ЗаказыОнлайн.Заказ = &Заказ";  
	Запрос.УстановитьПараметр("Заказ", Форма.Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Форма,Выборка);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;  
КонецФункции
Функция ВХран(Владелец,Данные,Ключ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	//ОбщегоНазначения.ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец,Данные,Ключ);
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции  

Функция ИзХран(Владелец,Ключ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец,Ключ);
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция СкладЦена() Экспорт
    СтруктураВозврата = Новый Структура("Склад,ВидЦен");
	ТочкиОтгрузки = Справочники.mona_ТочкиОтгрузки.Выбрать();
	Если ТочкиОтгрузки.Следующий() Тогда 
		СтруктураВозврата.Склад = ТочкиОтгрузки.Склад;
		СтруктураВозврата.ВидЦен = ТочкиОтгрузки.ВидЦеныОнлайн;
	КонецЕсли;
	Возврат СтруктураВозврата;	
КонецФункции
