 #Область ЗаполнениеПоРегистру
 &НаСервере
 Процедура mona_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	 Mona_СоздатьРеквизитыЭлементыДляДанныхРегистра();
	 Если Объект.Ссылка.Пустая() Тогда
		 Возврат;
	 КонецЕсли;	
	 ЕстьДанные = Mona_ЗаполнитьДанныеРегистра(); 	
	 ЭтаФорма["mona_ПоказыватьДанныеОнлайн"] = ЕстьДанные;
	 Элементы.mona_ГруппаЗаказОнлайн.Видимость = ЕстьДанные;
 КонецПроцедуры 
 
 &НаСервере
 функция Mona_ЗаполнитьДанныеРегистра()  
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЗаказыОнлайн.ПричинаОтмены КАК ПричинаОтмены,
	                |	ЗаказыОнлайн.ПризнакОтложенногоВозврата КАК ПризнакОтложенногоВозврата,
	                |	ЗаказыОнлайн.tiptoppay_id КАК tiptoppay_id
	                |ИЗ
	                |	РегистрСведений.ЗаказыОнлайн КАК ЗаказыОнлайн
	                |ГДЕ
	                |	ЗаказыОнлайн.Заказ = &Заказ";  
	 Запрос.УстановитьПараметр("Заказ", Объект.Ссылка.Заказ); 
	 //ТипВозврата ="";
	 //для каждого стр из Объект.Ссылка.Заказ.ОтмененныеЗапасы цикл
	 //     Элементы.ТипВозврата = ТипВозврата +"; "+стр.ТипВозврата.Наименование; 
	 //конеццикла;
	 //ЭтаФорма["ТипВозврата"]          		   =  ТипВозврата; 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 	ЭтаФорма["ПризнакОтложенногоВозврата"]		   =  Выборка.ПризнакОтложенногоВозврата; 
		 	ЭтаФорма["tiptoppay_id"]    		   =  Выборка.tiptoppay_id;
		 Возврат Истина;
	 КонецЕсли;
	 Возврат Ложь;  
 КонецФункции	
 
 Процедура Mona_СоздатьРеквизитыЭлементыДляДанныхРегистра() 
	 Добавляемые = Новый Массив;   
	 Добавляемые.Добавить(Новый РеквизитФормы("tiptoppay_id", Новый ОписаниеТипов("Строка")));
	 Добавляемые.Добавить(Новый РеквизитФормы("ТипВозврата", Новый ОписаниеТипов("СправочникСсылка.mona_ТипыВозврата")));	
	 Добавляемые.Добавить(Новый РеквизитФормы("ПризнакОтложенногоВозврата", Новый ОписаниеТипов("Булево")));    
	 Добавляемые.Добавить(Новый РеквизитФормы("mona_ПоказыватьДанныеОнлайн", Новый ОписаниеТипов("Булево")));
	 	 
	 ИзменитьРеквизиты(Добавляемые);           
	 Группа = Элементы.Добавить("mona_ГруппаЗаказОнлайн", Тип("ГруппаФормы"),ЭтаФорма);	
	 Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;  
	 Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная; 
	 Группа.Заголовок   = "Данные возврата";
	 //Группа.Отображение = ОтображениеОбычнойГруппы.Авто;   
	 Элементы.Переместить(Группа, Группа.Родитель, Mona_ПолучитьСледующийПосле("Шапка"));	 
	 Mona_ДобавитьПолеФормы("ТипВозврата",Группа,"ТипВозврата");
	 Mona_ДобавитьПолеФормы("ПризнакОтложенногоВозврата",Группа,"Отложенный возврат"); 
     Mona_ДобавитьПолеФормы("tiptoppay_id",Группа,"tiptoppay_id");
	 
 КонецПроцедуры	

 
  &НаСервере
 Процедура Mona_ДобавитьПолеФормы(ИмяРеквизита, Группа, Заголовок = "")
	 Поле = Элементы.Добавить("mona_Поле_" + ИмяРеквизита, Тип("ПолеФормы"), Группа);
	 Поле.Вид = ВидПоляФормы.ПолеВвода;
	 Поле.ПутьКДанным = ИмяРеквизита;     
	 Поле.РастягиватьПоГоризонтали = Ложь;    
	 Поле.Ширина = 10;
	 Если ЗначениеЗаполнено(Заголовок) Тогда
		 Поле.Заголовок = Заголовок;
	 Иначе
		 Поле.Заголовок =  Mona_РазбитьПоЗаглавным(ИмяРеквизита);
	 КонецЕсли;	
 КонецПроцедуры
 
 &НаСервере
 Функция Mona_РазбитьПоЗаглавным(Стр)
	 Результат = "";
	 Для Сч = 1 По СтрДлина(Стр) Цикл
		 Симв = Сред(Стр, Сч, 1);
		 Если Сч > 1 И Симв = ВРег(Симв) И Симв <> НРег(Симв) Тогда
			 Результат = Результат + " " + НРег(Симв);
		 Иначе
			 Результат = Результат + Симв;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат Результат;
 КонецФункции
 
 &НаСервере
 Функция Mona_ПолучитьСледующийПосле(ИмяЭлемента)                                                  
	 Элем = Элементы.Найти(ИмяЭлемента);
	 Если Элем = Неопределено Тогда
		 Возврат Неопределено;
	 КонецЕсли;
	 Родитель = Элем.Родитель;
	 Индекс = Родитель.ПодчиненныеЭлементы.Индекс(Элем);
	 Если Индекс +1< Родитель.ПодчиненныеЭлементы.Количество() Тогда
		 Возврат Родитель.ПодчиненныеЭлементы.Получить(Индекс +1);
	 КонецЕсли;
	 Возврат Неопределено;		
 КонецФункции
 
&НаКлиенте
Процедура прс_ПробитьЧекПрограммно() Экспорт
        ПробитьЧек(); 
КонецПроцедуры

&НаКлиенте
&После("РассчитатьСуммуВСтрокеТабличнойЧасти")
 Процедура mona_РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	 СтрокаТабличнойЧасти.Сумма = Окр(СтрокаТабличнойЧасти.Сумма,0,1);
 КонецПроцедуры
 #конецобласти